RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
#include "NTPClient_Generic.h"
#include "Timezone_Generic.h"
#include "WiFiUdp.h"
#include "WiFiClient.h"
#include "HTTPClient.h"

#include "DataContainerWio.h"
#include "OnOffDataContainerWio.h"
#include "OnOffSwitcherWio.h"
#include "SoundSwitcher.h"
#include "ImuManagerWio.h"
#include "AnalogSensorMgr.h"
#include "OnOffSensor.h"

#include "azure/core/az_platform.h"
#include "azure/core/az_http.h"
#include "azure/core/az_http_transport.h"
#include "azure/core/az_result.h"
#include "azure/core/az_config.h"
#include "azure/core/az_context.h"
#include "azure/core/az_span.h"

#include "Rs_TimeNameHelper.h"

// Now support ArduinoJson 6.0.0+ ( tested with v6.14.1 )
#include "ArduinoJson.h"      // get it from https://arduinojson.org/ or install via Arduino library manager

// Default Esp32 stack size of 8192 byte is not enough for this application.
// --> configure stack size dynamically from code to 16384
// https://community.platformio.org/t/esp32-stack-configuration-reloaded/20994/4

SET_LOOP_TASK_STACK_SIZE ( 16*1024 ); // 16KB
//SET_LOOP_TASK_STACK_SIZE ( 16*1024 ); // 16KB

//SET_LOOP_TASK_STACK_SIZE ( 32*1024 ); // 32KB  used this

// Allocate memory space in memory segment .dram0.bss, ptr to this memory space is later
// passed to TableClient (is used there as the place for some buffers to preserve stack )

//const uint16_t bufferStoreLength = 4000;
//const uint16_t bufferStoreLength = 20000;
const uint16_t bufferStoreLength = 10000; // Test 06.04.2025)

uint8_t bufferStore[bufferStoreLength] {0};
uint8_t * bufferStorePtr = &bufferStore[0];

char viessmannClientId[50] = VIESSMANN_CLIENT_ID;
char viessmannAccessToken[1120] = VIESSMANN_ACCESS_TOKEN;
char viessmannRefreshToken[60] = VIESSMANN_REFRESH_TOKEN;
char viessmannUserBaseUri[60] = VIESSMANN_USER_BASE_URI;
// RoSchmi delete next 2 lines ?
char viessmannIotBaseUri[60] = VIESSMANN_IOT_BASE_URI;
char viessmannTokenBaseUri[60] = VIESSMANN_TOKEN_BASE_URI;

char gasmeterBaseValueOffsetStr[10] = GASMETER_AI_API_BASEVALUE_OFFSET;
uint32_t gasmeterBaseValueOffsetInt =  strtoul(GASMETER_AI_API_BASEVALUE_OFFSET, NULL, 10);

DateTime AccessTokenRefreshTime = DateTime();
TimeSpan AccessTokenRefreshInterval = TimeSpan(VIESSMANN_TOKEN_REFRESH_INTERVAL_SECONDS);

ViessmannApiAccount myViessmannApiAccount(viessmannClientId, viessmannAccessToken, viessmannIotBaseUri, viessmannUserBaseUri, viessmannTokenBaseUri, true, false); 
ViessmannApiAccount * myViessmannApiAccountPtr = &myViessmannApiAccount;

ViessmannApiSelection viessmannApiSelection_01( "Heizung", 0, VIESSMANN_API_READ_INTERVAL_SECONDS);
ViessmannApiSelection * viessmannApiSelectionPtr_01 = &viessmannApiSelection_01;
 
AiOnTheEdgeApiSelection gasmeterApiSelection("Gasmeter", 0, (int32_t)GASMETER_AI_API_READ_INTERVAL_SECONDS, gasmeterBaseValueOffsetInt);
AiOnTheEdgeApiSelection * gasmeterApiSelectionPtr = &gasmeterApiSelection;

bool viessmannUserId_is_read = false;
const uint16_t viessmannUserBufLen = 1000;
uint8_t viessmannApiUser [viessmannUserBufLen] {0};

bool viessmannEquip_is_read = false;
uint32_t Data_0_Id = 0;
const int equipBufLen = 35;
char Data_0_Description[equipBufLen]= {0};
char Data_0_Address_Street[equipBufLen] {0};
char Data_0_Address_HouseNumber[equipBufLen] = {0};
char Gateways_0_Serial[equipBufLen] = {0};
char Gateways_0_Devices_0_Id[equipBufLen] = {0};

#define VI_FEATURES_COUNT 16
ViessmannApiSelection::Feature features[VI_FEATURES_COUNT];

#define AI_FEATURES_COUNT 6
AiOnTheEdgeApiSelection::Feature ai_features[AI_FEATURES_COUNT];

bool isFirstGasmeterRead = true;

#define IS_ACTIVE true
OnOffSensor OnOffBurnerStatus(IS_ACTIVE, false, true, true, DateTime());
OnOffSensor OnOffCirculationPumpStatus(IS_ACTIVE, false, true, true, DateTime());
OnOffSensor OnOffHotWaterCircualtionPumpStatus(IS_ACTIVE);
OnOffSensor OnOffHotWaterPrimaryPumpStatus(IS_ACTIVE);

//void * StackPtrAtStart;
//void * StackPtrEnd;
UBaseType_t * StackPtrAtStart;
UBaseType_t * StackPtrEnd;

UBaseType_t watermarkStart;
TaskHandle_t taskHandle_0 =  xTaskGetCurrentTaskHandleForCPU(0);
TaskHandle_t taskHandle_1 =  xTaskGetCurrentTaskHandleForCPU(1);

bool watchDogEnabled = false;
bool watchDogCommandSuccessful = false;

RESET_REASON resetReason_0;
RESET_REASON resetReason_1;

uint8_t lastResetCause = 0;

#define GPIOPin 0
bool buttonPressed = false;

const char analogTableName[45] = ANALOG_TABLENAME;
const char viessmAnalogTableName_01[45] = VIESSMANN_ANALOG_TABLENAME_01;

const char OnOffTableName_1[45] = ON_OFF_TABLENAME_01;
const char OnOffTableName_2[45] = ON_OFF_TABLENAME_02;
const char OnOffTableName_3[45] = ON_OFF_TABLENAME_03;
const char OnOffTableName_4[45] = ON_OFF_TABLENAME_04;

// The PartitionKey for the analog table may have a prefix to be distinguished, here: "Y2_" 
const char * analogTablePartPrefix = (char *)ANALOG_TABLE_PART_PREFIX;

// The PartitionKey for the On/Off-tables may have a prefix to be distinguished, here: "Y3_" 
const char * onOffTablePartPrefix = (char *)ON_OFF_TABLE_PART_PREFIX;

// The PartitinKey can be augmented with a string representing year and month (recommended)
const bool augmentPartitionKey = true;

// The TableName can be augmented with the actual year (recommended)
const bool augmentTableNameWithYear = true;

enum class SampleTimeFormatOpt {
    FORMAT_FULL_1, //!< `MM/DD/YYYY hh:mm:ss + min`
    FORMAT_DATE_GER, //!< `DD.MM.YYYY`
  };
  

typedef const char* X509Certificate;

typedef int t_httpCode;

t_httpCode httpCode = -1;


// https://techcommunity.microsoft.com/t5/azure-storage/azure-storage-tls-critical-changes-are-almost-here-and-why-you/ba-p/2741581
// baltimore_root_ca will expire in 2025, then take digicert_globalroot_g2_ca
//X509Certificate myX509Certificate = baltimore_root_ca;

X509Certificate myX509Certificate = digicert_globalroot_g2_ca;

// Init the Secure client object

#if AZURE_TRANSPORT_PROTOKOL == 1
    static WiFiClientSecure wifi_client;     
#else
    static WiFiClient wifi_client;
#endif

// secure_wifi_client is used for Viessmann Api https requests
// the static client is created one time and stays forever
static WiFiClientSecure secure_wifi_client;

// plain_wifi_client is used for AiOnTheEdge http requests
// the static client is created one time and stays forever
static WiFiClient plain_wifi_client;


  // A UDP instance to let us send and receive packets over UDP
  WiFiUDP ntpUDP;
  static NTPClient timeClient(ntpUDP);
  
  HTTPClient http;
  
  // Ptr to HTTPClient
  static HTTPClient * httpPtr = &http;

// Define Datacontainer with SendInterval and InvalidateInterval as defined in config.h
int sendIntervalSeconds_Vi = (SENDINTERVAL_MINUTES_VI * 60) < 1 ? 1 : (SENDINTERVAL_MINUTES_VI * 60);
int sendIntervalSeconds_Ai = (SENDINTERVAL_MINUTES_AI * 60) < 1 ? 1 : (SENDINTERVAL_MINUTES_AI * 60);

