RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
DataContainerWio dataContainer(TimeSpan(sendIntervalSeconds_Ai), TimeSpan(0, 0, INVALIDATEINTERVAL_MINUTES % 60, 0), (float)MIN_DATAVALUE_AI, (float)MAX_DATAVALUE_AI, (float)MAGIC_NUMBER_INVALID);

DataContainerWio dataContainerAnalogViessmann01(TimeSpan(sendIntervalSeconds_Vi), TimeSpan(0, 0, INVALIDATEINTERVAL_MINUTES % 60, 0), (float)MIN_DATAVALUE_VI, (float)MAX_DATAVALUE_VI, (float)MAGIC_NUMBER_INVALID);

AnalogSensorMgr analogSensorMgr_Ai_01(MAGIC_NUMBER_INVALID);

AnalogSensorMgr analogSensorMgr_Vi_01(MAGIC_NUMBER_INVALID);

OnOffDataContainerWio onOffDataContainer;
 
OnOffSwitcherWio onOffSwitcherWio;

// Possible configuration for Adafruit Huzzah Esp32
static const i2s_pin_config_t pin_config_Adafruit_Huzzah_Esp32 = {
    .bck_io_num = 14,                   // BCKL
    .ws_io_num = 15,                    // LRCL
    .data_out_num = I2S_PIN_NO_CHANGE,  // not used (only for speakers)
    .data_in_num = 32                   // DOUT
};
// Possible configuration for some Esp32 DevKitC V4
static const i2s_pin_config_t pin_config_Esp32_dev = {
    .bck_io_num = 26,                   // BCKL
    .ws_io_num = 25,                    // LRCL
    .data_out_num = I2S_PIN_NO_CHANGE,  // not used (only for speakers)
    .data_in_num = 22                   // DOUT
};

// RoSchmi, was wrong ?
MicType usedMicType = (USED_MICROPHONE == 0) ? MicType::SPH0645LM4H : MicType::INMP441;
//MicType usedMicType = (USED_MICROPHONE == 0) ? MicType::SPH0645LM4H : MicType::INMP441; 


SoundSwitcher soundSwitcher(pin_config_Esp32_dev, usedMicType);
//SoundSwitcher soundSwitcher(pin_config_Adafruit_Huzzah_Esp32, usedMicType);

FeedResponse feedResult;

int soundSwitcherUpdateInterval = SOUNDSWITCHER_UPDATEINTERVAL;
uint32_t soundSwitcherReadDelayTime = SOUNDSWITCHER_READ_DELAYTIME;

float LastGasmeterReading = 0.0f;
float LastGasmeterDayConsumption = 0.0f;

uint32_t GasmeterReadCounter = 0; //only for debugging, should be deleted in future

uint64_t loopCounter = 0;
int insertCounterAnalogTable = 0;
int insertCounterApiAnalogTable01 = 0;

uint32_t tryUploadCounter = 0;
uint32_t failedUploadCounter = 0;
uint32_t timeNtpUpdateCounter = 0;

uint32_t loadViFeaturesCount = 0;
uint32_t loadViFeaturesResp400Count = 0;
uint32_t loadViFeaturesRespOtherCount = 0;

uint32_t loadGasMeterJsonCount = 0;
uint32_t loadRefreshTokenCount = 0;

// not used on Esp32
int32_t sysTimeNtpDelta = 0;

  bool ledState = false;
  
  const int timeZoneOffset = (int)TIMEZONEOFFSET;
  const int dstOffset = (int)DSTOFFSET;

  Rs_TimeNameHelper timeNameHelper;

  DateTime dateTimeUTCNow;    // Seconds since 2000-01-01 08:00:00
  DateTime localTime;
  TimeSpan timeDiffUtcToLocal;

  Timezone myTimezone;

// Set Azure transport protocol as defined in config.h
static bool UseHttps_State = AZURE_TRANSPORT_PROTOKOL == 0 ? false : true;
static bool UseCaCert_State = AZURE_TRANSPORT_PROTOKOL == 0 ? false : true;

const char * PERSIST_FILE = "/PersistantData.json";  // For values that shoult persist after reset
const char * CONFIG_FILE = "/ConfigSW.json";         // Configuration for Azure and threshold
                                                     // 'CONFIG_FILENAME' is used for Router Credentials

#define AZURE_CONFIG_ACCOUNT_NAME "AzureStorageAccName"

#define AZURE_CONFIG_ACCOUNT_KEY   "YourStorageAccountKey"

// Parameter for WiFi-Manager
char azureAccountName[20] =  AZURE_CONFIG_ACCOUNT_NAME;
char azureAccountKey[90] =  AZURE_CONFIG_ACCOUNT_KEY;
char sSwiThresholdStr[6] = SOUNDSWITCHER_THRESHOLD;

#define AzureAccountName_Label "azureAccountName"
#define AzureAccountKey_Label "azureAccountKey"
#define ViessmannClientId_Label "viessmannClientId"
#define ViessmannRefreshToken_Label "viessmannRefreshToken"
#define SoundSwitcherThresholdString_Label "sSwiThresholdStr"

#define GasmeterBaseValueOffset_Label "gasmeterBaseValueOffsetStr"

// for Ai-on-the-edge-devices
char GasMeterAccountName[20] =  "gasmeter";
char GasMeterHostName[20] = "gasmeter";

char WaterMeterAccountName[20] =  "watermeter";
char WaterMeterHostName[20] = "watermeter";

// Function Prototypes for WiFiManager
bool loadApplConfigData();
bool saveApplConfigData();

// Note: AzureAccountName and azureccountKey will be changed later in setup
CloudStorageAccount myCloudStorageAccount(azureAccountName, azureAccountKey, UseHttps_State, UseCaCert_State);
CloudStorageAccount * myCloudStorageAccountPtr = &myCloudStorageAccount;

RestApiAccount gasmeterApiAccount(GasMeterAccountName, "", GasMeterHostName, false, false);
 


void GPIOPinISR()
{
  buttonPressed = true;
}

// function forward declarations
void trimLeadingSpaces(char * workstr);
ViessmannApiSelection::Feature ReadViessmannApi_Analog_01(int pSensorIndex, const char * pSensorName, ViessmannApiSelection * pViessmannApiSelectionPtr);
AiOnTheEdgeApiSelection:: Feature ReadAiOnTheEdgeApi_Analog_01(int pSensorIndex, RestApiAccount * pRestApiAccount, const char * pSensorName, AiOnTheEdgeApiSelection * pAiOnTheEdgeApiSelectionPtr);
t_httpCode refresh_Vi_AccessTokenFromApi(X509Certificate pCaCert, ViessmannApiAccount * viessmannApiAccountPtr, const char * refreshToken);
t_httpCode read_Vi_FeaturesFromApi(X509Certificate pCaCert, ViessmannApiAccount * viessmannApiAccountPtr, uint32_t Data_0_Id, const char * p_gateways_0_serial, const char * p_gateways_0_devices_0_id, ViessmannApiSelection * apiSelectionPtr);
t_httpCode read_Vi_EquipmentFromApi(X509Certificate pCaCert, ViessmannApiAccount * viessmannApiAccountPtr, uint32_t * p_data_0_id, const int equipBufLen, char * p_data_0_description, char * p_data_0_address_street, char * p_data_0_address_houseNumber, char * p_gateways_0_serial, char * p_gateways_0_devices_0_id);
t_httpCode readJsonFromRestApi(X509Certificate pCaCert, RestApiAccount * pRestApiAccount, AiOnTheEdgeApiSelection * apiSelectionPtr);
t_httpCode setAiPreValueViaRestApi(X509Certificate pCaCert, RestApiAccount * pRestApiAccount, const char * pPreValue);
t_httpCode read_Vi_UserFromApi(X509Certificate pCaCert, ViessmannApiAccount * viessmannApiAccountPtr);
void print_reset_reason(RESET_REASON reason);
void scan_WIFI();
String floToStr(float value, char decimalChar = '.');
bool isValidFloat(const char* str);
//float ReadAnalogSensor_01(int pSensorIndex);
ValueStruct ReadAnalogSensorStruct_01(int pSensorIndex);
void createSampleTime(const DateTime dateTimeUTCNow, const int timeZoneOffsetUTC, char * sampleTime, const SampleTimeFormatOpt formatOpt = SampleTimeFormatOpt::FORMAT_FULL_1);
az_http_status_code  createTable(CloudStorageAccount * myCloudStorageAccountPtr, X509Certificate pCaCert, const char * tableName);
az_http_status_code insertTableEntity(CloudStorageAccount *myCloudStorageAccountPtr,X509Certificate pCaCert, const char * pTableName, TableEntity pTableEntity, char * outInsertETag);
void makePartitionKey(const char * partitionKeyprefix, bool augmentWithYear, DateTime dateTime, az_span outSpan, size_t *outSpanLength);
void makeRowKey(DateTime actDate, az_span outSpan, size_t *outSpanLength);
int getDayNum(const char * day);
int getMonNum(const char * month);
int getWeekOfMonthNum(const char * weekOfMonth);
uint8_t connectMultiWiFi();

// Here: Begin of WiFi Manager definitions
//***************************************************************

#if !( defined(ESP8266) ||  defined(ESP32) )
  #error This code is intended to run on the ESP8266 or ESP32 platform! Please check your Tools->Board setting.
#endif

