RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
    // Set content of the structs to 0
  memset((void *) &WM_config,       0, sizeof(WM_config));
  memset((void *) &WM_STA_IPconfig, 0, sizeof(WM_STA_IPconfig));
  
  if (file)
  {
    file.readBytes((char *) &WM_config,   sizeof(WM_config));

    // RoSchmi 12.07.2024
    /*
    String theSSID = (char *) &WM_config.WiFi_Creds[0].wifi_ssid;
    String theSSID1 = (char *) &WM_config.WiFi_Creds[1].wifi_ssid;
    Serial.println("");
    Serial.println("*******************");
    Serial.println(theSSID);
    Serial.println(theSSID1);
    Serial.println("*******************");
    */

    file.readBytes((char *) &WM_STA_IPconfig, sizeof(WM_STA_IPconfig));
     
    file.close();
    LOGERROR(F("OK"));

    if ( WM_config.checksum != calcChecksum( (uint8_t*) &WM_config, sizeof(WM_config) - sizeof(WM_config.checksum) ) )
    {
      LOGERROR(F("WM_config checksum wrong"));  
      return false;
    }
    displayIPConfigStruct(WM_STA_IPconfig);
   
    return true;
  }
  else
  {
    LOGERROR(F("failed"));

    return false;
  }
}
#pragma endregion

#pragma region  saveWiFiConfigData()   // Save Router WiFi-Credentials to file
void saveWiFiConfigData()   // Save Router WiFi-Credentials to file
{
  File file = FileFS.open(CONFIG_FILENAME, "w");
  LOGERROR(F("SaveWiFiCfgFile "));

  if (file)
  {
    WM_config.checksum = calcChecksum( (uint8_t*) &WM_config, sizeof(WM_config) - sizeof(WM_config.checksum) );   
    file.write((uint8_t*) &WM_config, sizeof(WM_config));
    displayIPConfigStruct(WM_STA_IPconfig);

    file.write((uint8_t*) &WM_STA_IPconfig, sizeof(WM_STA_IPconfig));
    
    file.close();
    LOGERROR(F("OK"));
  }
  else
  {
    LOGERROR(F("failed"));
  }
}   // end saveWiFiConfigData
#pragma endregion

#pragma region loadPermanentData()
bool loadPermanentData()
{
  File f = FileFS.open(PERSIST_FILE, "r");
  if (!f)
  {
    Serial.println(F("Persistent Data file not found"));
    return false;
  }
  else
  {
    // we could open the file
    size_t size = f.size();
    // Allocate a buffer to store contents of the file.
    std::unique_ptr<char[]> buf(new char[size + 1]);

    // Read and store file contents in buf
    f.readBytes(buf.get(), size);
    // Closing file
    f.close();
    return false;
  }
}
#pragma endregion

#pragma region loadApplConfigData()
bool loadApplConfigData()    // Config parameter for Azure credentials, Viessmann Refresh-Token and threshold
{
  // this opens the config file in read-mode
  File f = FileFS.open(CONFIG_FILE, "r");

  if (!f)
  {
    Serial.println(F("Configuration file not found"));
    return false;
  }
  else
  { 
    // we could open the file
    size_t size = f.size();
    // Allocate a buffer to store contents of the file.
    std::unique_ptr<char[]> buf(new char[size + 1]);

    // Read and store file contents in buf
    f.readBytes(buf.get(), size);
    // Closing file
    f.close();

    // Using dynamic JSON buffer which is not the recommended memory model, but anyway
    // See https://github.com/bblanchon/ArduinoJson/wiki/Memory%20model
#if (ARDUINOJSON_VERSION_MAJOR >= 6)
    
    DynamicJsonDocument json(1024);
    auto deserializeError = deserializeJson(json, buf.get());
    if ( deserializeError )
    {
      Serial.println(F("JSON parseObject() failed"));
      return false;
    }
    Serial.println(F("Here we could print the custom parameters like Azure Credentials read from filesystem"));
    //serializeJson(json, Serial);
#else
    DynamicJsonBuffer jsonBuffer;
    // Parse JSON string
    JsonObject& json = jsonBuffer.parseObject(buf.get());
    // Test if parsing succeeds.
    if (!json.success())
    {
      Serial.println(F("JSON parseObject() failed"));
      return false;
    }
    json.printTo(Serial);
#endif

    // Parse all config file parameters, override
    // local config variables with parsed values    
    if (json.containsKey(AzureAccountName_Label))
    {
      strcpy(azureAccountName, json[AzureAccountName_Label]);      
    }
    if (json.containsKey(AzureAccountKey_Label))
    {
      strcpy(azureAccountKey, json[AzureAccountKey_Label]);    
    }
    if (json.containsKey(ViessmannClientId_Label))
    {
      if (strlen(json[ViessmannClientId_Label]) > 2)
      {
        strcpy(viessmannClientId, json[ViessmannClientId_Label]);
      }      
    }
    if (json.containsKey(ViessmannRefreshToken_Label))
    {
      if (strlen(json[ViessmannRefreshToken_Label]) > 2)
      {
        strcpy(viessmannRefreshToken, json[ViessmannRefreshToken_Label]);
      }      
    }
    if (json.containsKey(GasmeterBaseValueOffset_Label))
    {
      strcpy(gasmeterBaseValueOffsetStr, json[GasmeterBaseValueOffset_Label]);
      gasmeterBaseValueOffsetInt = strtoul((const char *)gasmeterBaseValueOffsetStr, NULL, 10);
    }
    if (json.containsKey(SoundSwitcherThresholdString_Label))
    {
      strcpy(sSwiThresholdStr, json[SoundSwitcherThresholdString_Label]);      
    }
  }
  Serial.println(F("\nCustom config file was successfully parsed")); 
  return true;
}
#pragma endregion

#pragma region saveApplConfigData() // Azure, Viessmann Refresh-Token, Noise threshold
bool saveApplConfigData() // Config parameter for Azure credentials, Viessmann Refresh-Token and threshold
{
  LOGERROR(F("Saving additional configuration to file"));
  
#if (ARDUINOJSON_VERSION_MAJOR >= 6)
  DynamicJsonDocument json(1024);
#else
  DynamicJsonBuffer jsonBuffer;
  JsonObject& json = jsonBuffer.createObject();
#endif

  // Occasionally it happenend that blanks were accidently
  // added at start of the strings through 'copy and paste'
  // so to be safe, leading blanks are removed
  trimLeadingSpaces((char *)azureAccountKey);
  trimLeadingSpaces((char *)viessmannClientId);
  trimLeadingSpaces((char *)viessmannRefreshToken);
  trimLeadingSpaces((char *)gasmeterBaseValueOffsetStr);

  // JSONify local configuration parameters 
  json[AzureAccountName_Label] = azureAccountName;
  json[AzureAccountKey_Label] = strlen(azureAccountKey) > 2 ? azureAccountKey : "";
  json[ViessmannClientId_Label] = strlen(viessmannClientId) > 2 ? viessmannClientId : "";
  json[ViessmannRefreshToken_Label] = strlen(viessmannRefreshToken) > 2 ? viessmannRefreshToken : "";
  
  //json[AzureAccountKey_Label] = azureAccountKey;
  //json[ViessmannClientId_Label] = viessmannClientId;
  //json[ViessmannRefreshToken_Label] = viessmannRefreshToken;
  json[GasmeterBaseValueOffset_Label] = gasmeterBaseValueOffsetStr;
  json[SoundSwitcherThresholdString_Label] = sSwiThresholdStr;
  // Open file for writing
  File f = FileFS.open(CONFIG_FILE, "w");
  
