RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
  analogSensorMgr_Vi_01.SetReadInterval(API_ANALOG_SENSOR_READ_INTERVAL_SECONDS);
  
  httpCode = refresh_Vi_AccessTokenFromApi((const char*)"dummyCaCert", myViessmannApiAccountPtr, viessmannRefreshToken);
  if (httpCode == t_http_codes::HTTP_CODE_OK)
  {   
    AccessTokenRefreshTime = dateTimeUTCNow;
  }
  else
  {     
    Serial.println(F("Couldn't refresh accessToken from Viessmann Cloud. Error message is:"));
    Serial.println((char*)bufferStorePtr);
    ESP.restart();
    while(true)
    {
      delay(500);
    }
  }
  
  httpCode = read_Vi_UserFromApi((const char*)"dummyCaCert", myViessmannApiAccountPtr);
  if (httpCode == t_http_codes::HTTP_CODE_OK)
  {
    Serial.println(F("UserId successfully read from Viessmann Cloud"));
    Serial.println(F(""));
    viessmannUserId_is_read = true;    
  }
  else
  {     
    Serial.println(F("Couldn't read UserId from Viessmann Cloud.\r\nError message is:"));
    Serial.println((char*)bufferStorePtr);
    ESP.restart();
    while(true)
    {
      delay(500);
    }
  }

  
  httpCode = read_Vi_EquipmentFromApi((const char*)"dummyCaCert", myViessmannApiAccountPtr, &Data_0_Id, equipBufLen, Data_0_Description, Data_0_Address_Street, Data_0_Address_HouseNumber, Gateways_0_Serial, Gateways_0_Devices_0_Id);
  if (httpCode == t_http_codes::HTTP_CODE_OK)
  {
    Serial.println(F("Equipment successfully read from Viessmann Cloud"));
    viessmannEquip_is_read = true;
  }
  else
  {     
    Serial.println(F("Couldn't read Equipment from Viessmann Cloud.\r\nError message is:"));
    Serial.println((char*)bufferStorePtr);
    // RoSchmi
    
    ESP.restart();
    while(true)
    {
      delay(500);
    }
      
  }
}
#pragma endregion

#pragma region     loop()
void loop()
{
  check_status();   // Checks if WiFi is still connected
                    // if not, try other Accesspoint
  // put your main code here, to run repeatedly:
  if (++loopCounter % 100000 == 0)   // Make decisions to send data every 100000 th round and toggle Led to signal that App is running
  {

    #if SERIAL_PRINT == 1
      ledState = !ledState;
      digitalWrite(LED_BUILTIN, ledState);    // toggle LED to signal that App is running
    #endif

    #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
    #endif
    
      // Update RTC from Ntp when ntpUpdateInterval has expired, retry when RetryInterval has expired       
      if (timeClient.update())
      {                                                                      
        dateTimeUTCNow = timeClient.getUTCEpochTime();
        
        timeNtpUpdateCounter++;

        #if SERIAL_PRINT == 1
          // Indicate that NTP time was updated
          char buffer[35] = {0};     
          strcpy(buffer, "NTP-Utc: YYYY-MM-DD hh:mm:ss");           
          dateTimeUTCNow.toString(buffer);
          Serial.println(buffer);
        #endif
      }  // End NTP stuff
          
      dateTimeUTCNow = timeClient.getUTCEpochTime();
      
      // Get offset in minutes between UTC and local time with consideration of DST
      int timeZoneOffsetUTC = myTimezone.utcIsDST(dateTimeUTCNow.unixtime()) ? TIMEZONEOFFSET + DSTOFFSET : TIMEZONEOFFSET;
      
      localTime = myTimezone.toLocal(dateTimeUTCNow.unixtime());
      timeDiffUtcToLocal = localTime.operator-(dateTimeUTCNow);
      
      // refresh Viessmann access token if refresh interval has expired 
      if ((AccessTokenRefreshTime.operator+(AccessTokenRefreshInterval)).operator<(dateTimeUTCNow))
      {
          httpCode = refresh_Vi_AccessTokenFromApi((const char*)"dummyCaCert", myViessmannApiAccountPtr, viessmannRefreshToken);
          
          if (httpCode == t_http_codes::HTTP_CODE_OK)
          {           
            AccessTokenRefreshTime = dateTimeUTCNow;
          }
          else
          {
            Serial.println(F("Token Refresh failed\n"));            
            AccessTokenRefreshTime = dateTimeUTCNow.operator-(TimeSpan(300));
          }
      }

      // In the last 15 sec of each day we set a pulse to Off-State when we had On-State before
      bool isLast15SecondsOfDay = (localTime.hour() == 23 && localTime.minute() == 59 &&  localTime.second() > 45) ? true : false;

      // Get readings from 4 different analog sensors stored in the Viessmann Cloud    
      // and store the values in a container
      dataContainerAnalogViessmann01.SetNewValue(0, dateTimeUTCNow, atof((ReadViessmannApi_Analog_01(0, (const char *)"_94_heating_temperature_outside", viessmannApiSelectionPtr_01)).value)); // Aussen
      dataContainerAnalogViessmann01.SetNewValue(1, dateTimeUTCNow, atof((ReadViessmannApi_Analog_01(1, (const char *)"_2_temperature_main", viessmannApiSelectionPtr_01)).value)); // Vorlauf                
      dataContainerAnalogViessmann01.SetNewValue(2, dateTimeUTCNow, atof((ReadViessmannApi_Analog_01(2, (const char *)"_89_heating_dhw_cylinder_temperature",viessmannApiSelectionPtr_01)).value)); // Boiler
      dataContainerAnalogViessmann01.SetNewValue(3, dateTimeUTCNow, atof((ReadViessmannApi_Analog_01(3, (const char *)"_6_burner_modulation",viessmannApiSelectionPtr_01)).value));  // Modulation
      

      ledState = !ledState;
      digitalWrite(LED_BUILTIN, ledState);    // toggle LED to signal that App is running

      // Get readings from 4 different analog sensors, (preferably measured by the Esp 32 device, e.g. noise level)     
      // and store the values in a container      
      dataContainer.SetNewValueStruct(0, dateTimeUTCNow, ReadAnalogSensorStruct_01(0), true);
      dataContainer.SetNewValueStruct(1, dateTimeUTCNow, ReadAnalogSensorStruct_01(1), true);     
      dataContainer.SetNewValueStruct(2, dateTimeUTCNow, ReadAnalogSensorStruct_01(2), false);      
      dataContainer.SetNewValueStruct(3, dateTimeUTCNow, ReadAnalogSensorStruct_01(3), false); 
      
      #pragma region Automatic OnOffSwitcher has toggled ? Is for tests and debugging
      // Check if automatic OnOffSwitcher has toggled (used to simulate on/off changes)
      // and accordingly change the state of one representation (here index 3) in onOffDataContainer
      // This can be used for debugging, shows that displaying on/off states is
      // working
      /*
      if (onOffSwitcherWio.hasToggled(dateTimeUTCNow))
      {
        bool state = onOffSwitcherWio.GetState();
        onOffDataContainer.SetNewOnOffValue(3, !state, dateTimeUTCNow, timeZoneOffsetUTC);    
      }
      */
      #pragma endregion
      
      // Check if one of the here listed On/Off states has changed     
      // (here: Burner, Circulation Pump, HotWaterCirculation Pump,
      // HotWaterPimary Pump)
      #pragma region Check if one of the Viessmann On/Off states has changed
      if (OnOffBurnerStatus.HasChangedState())
      {    
        onOffDataContainer.SetNewOnOffValue(0, OnOffBurnerStatus.GetStateAndResetChangedFlag(), dateTimeUTCNow, timeZoneOffsetUTC);
      }

