RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
      if (OnOffCirculationPumpStatus.HasChangedState())
      {
        onOffDataContainer.SetNewOnOffValue(1, OnOffCirculationPumpStatus.GetStateAndResetChangedFlag(), dateTimeUTCNow, timeZoneOffsetUTC);
      }

      if (OnOffHotWaterCircualtionPumpStatus.HasChangedState())
      {
        onOffDataContainer.SetNewOnOffValue(2, OnOffHotWaterCircualtionPumpStatus.GetStateAndResetChangedFlag(), dateTimeUTCNow, timeZoneOffsetUTC);
      }

      if (OnOffHotWaterPrimaryPumpStatus.HasChangedState())
      {
        onOffDataContainer.SetNewOnOffValue(3, OnOffHotWaterPrimaryPumpStatus.GetStateAndResetChangedFlag(), dateTimeUTCNow, timeZoneOffsetUTC);
      }
      #pragma endregion
      
      #pragma region for Burner Sound Sensor (not used in this App)
      // This is for Burner Sound Sensor (need not to be used in this App)    
      /*
      if (feedResult.isValid && (feedResult.hasToggled || feedResult.analogToSend))
      {
          if (feedResult.hasToggled)
          {
            onOffDataContainer.SetNewOnOffValue(0, feedResult.state, dateTimeUTCNow, timeZoneOffsetUTC);
            Serial.print("\r\nHas toggled, new state is: ");
            Serial.println(feedResult.state == true ? "High" : "Low");
            Serial.println();
          }
          // if toogled activate make hasToBeSent flag
          // so that the analog values have to be updated in the cloud
          if (feedResult.analogToSend)
          {
            dataContainer.setHasToBeSentFlag();
            Serial.print("Average is: ");
            Serial.println(feedResult.avValue);             
            Serial.println();
          }           
      }
      */
      #pragma endregion

      #pragma region Check if something has to be sent to Azure, if so --> do           
      // Check if something is to do: send analog data ? send On/Off-Data ? Handle EndOfDay stuff ?
      //if (false)
      if (dataContainerAnalogViessmann01.hasToBeSent() || dataContainer.hasToBeSent() || onOffDataContainer.One_hasToBeBeSent(localTime) || isLast15SecondsOfDay)
      {     
        //Create some buffer
        char sampleTime[25] {0};    // Buffer to hold sampletime        
        char strData[100] {0};          // Buffer to hold display message
        
        char EtagBuffer[50] {0};    // Buffer to hold returned Etag

        // Create az_span to hold partitionkey
        char partKeySpan[25] {0};
        size_t partitionKeyLength = 0;
        az_span partitionKey = AZ_SPAN_FROM_BUFFER(partKeySpan);
        
        // Create az_span to hold rowkey
        char rowKeySpan[25] {0};
        size_t rowKeyLength = 0;
        az_span rowKey = AZ_SPAN_FROM_BUFFER(rowKeySpan);
        
        #pragma region if (dataContainerAnalogViessmann01.hasToBeSent())
        if (dataContainerAnalogViessmann01.hasToBeSent())   // have to send analog values read from Viessmann ?
        {         
          // Retrieve edited sample values from container         
          SampleValueSet sampleValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, true);
          //Serial.printf("Got checked Sample values\n");      
          createSampleTime(sampleValueSet.LastUpdateTime, timeZoneOffsetUTC, (char *)sampleTime);
          // Define name of the table (arbitrary name + actual year, like: AnalogTestValues2020)         
          String augmentedAnalogTableName = viessmAnalogTableName_01; 
          if (augmentTableNameWithYear)
          {
            // RoSchmi changed 10.07.2024 to resolve issue 1         
            //augmentedAnalogTableName += (dateTimeUTCNow.year());
            augmentedAnalogTableName += (localTime.year()); 
          }         
          // Create Azure Storage Table if table doesn't exist
          if (localTime.year() != dataContainerAnalogViessmann01.Year)    // if new year
          {           
            az_http_status_code respCode = createTable(myCloudStorageAccountPtr, myX509Certificate, (char *)augmentedAnalogTableName.c_str());
            
            Serial.printf("\r\nCreate Table: Statuscode: %s\n", ((String)respCode).c_str());

            if ((respCode == AZ_HTTP_STATUS_CODE_CONFLICT) || (respCode == AZ_HTTP_STATUS_CODE_CREATED))
            {
              dataContainerAnalogViessmann01.Set_Year(localTime.year());                   
            }
            else
            {
              // Reset board if not successful
             
             //SCB_AIRCR = 0x05FA0004;             
            }                     
          }
          
          // Create an Array of (here) 5 Properties
          // Each Property consists of the Name, the Value and the Type (here only Edm.String is supported)

          // Besides PartitionKey and RowKey we have 5 properties to be stored in a table row
          // (SampleTime and 4 samplevalues)
          const size_t analogPropertyCount = 5;
          EntityProperty AnalogPropertiesArray[analogPropertyCount];
         
          #if ANALOG_SENSORS_USE_AVERAGE == 1
            AnalogPropertiesArray[0] = (EntityProperty)TableEntityProperty((char *)"SampleTime", (char *) sampleTime, (char *)"Edm.String");
            AnalogPropertiesArray[1] = (EntityProperty)TableEntityProperty((char *)"T_1", (char *)floToStr(sampleValueSet.SampleValues[0].AverageValue).c_str(), (char *)"Edm.String");
            AnalogPropertiesArray[2] = (EntityProperty)TableEntityProperty((char *)"T_2", (char *)floToStr(sampleValueSet.SampleValues[1].AverageValue).c_str(), (char *)"Edm.String");
            AnalogPropertiesArray[3] = (EntityProperty)TableEntityProperty((char *)"T_3", (char *)floToStr(sampleValueSet.SampleValues[2].AverageValue).c_str(), (char *)"Edm.String");
            AnalogPropertiesArray[4] = (EntityProperty)TableEntityProperty((char *)"T_4", (char *)floToStr(sampleValueSet.SampleValues[3].AverageValue).c_str(), (char *)"Edm.String");         
          #else
            AnalogPropertiesArray[0] = (EntityProperty)TableEntityProperty((char *)"SampleTime", (char *) sampleTime, (char *)"Edm.String");
            AnalogPropertiesArray[1] = (EntityProperty)TableEntityProperty((char *)"T_1", (char *)floToStr(sampleValueSet.SampleValues[0].Value).c_str(), (char *)"Edm.String");
            AnalogPropertiesArray[2] = (EntityProperty)TableEntityProperty((char *)"T_2", (char *)floToStr(sampleValueSet.SampleValues[1].Value).c_str(), (char *)"Edm.String");
            AnalogPropertiesArray[3] = (EntityProperty)TableEntityProperty((char *)"T_3", (char *)floToStr(sampleValueSet.SampleValues[2].Value).c_str(), (char *)"Edm.String");
            AnalogPropertiesArray[4] = (EntityProperty)TableEntityProperty((char *)"T_4", (char *)floToStr(sampleValueSet.SampleValues[3].Value).c_str(), (char *)"Edm.String");
          #endif
         
          // Create the PartitionKey (special format)
          makePartitionKey(analogTablePartPrefix, augmentPartitionKey, localTime, partitionKey, &partitionKeyLength);
          partitionKey = az_span_slice(partitionKey, 0, partitionKeyLength);
         
          // Create the RowKey (special format)        
          makeRowKey(localTime, rowKey, &rowKeyLength);          
          rowKey = az_span_slice(rowKey, 0, rowKeyLength);
          
          
                    
          // Create TableEntity consisting of PartitionKey, RowKey and the properties named 'SampleTime', 'T_1', 'T_2', 'T_3' and 'T_4'
          AnalogTableEntity analogTableEntity(partitionKey, rowKey, az_span_create_from_str((char *)sampleTime),  AnalogPropertiesArray, analogPropertyCount);
          
