RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
          #if SERIAL_PRINT == 1
            Serial.printf("Trying to insert %u \r\n", insertCounterApiAnalogTable01);
            Serial.printf("Analog Table Name: %s \r\n\n", (const char *)augmentedAnalogTableName.c_str()); 
          #endif
             
          // Keep track of tries to insert and check for memory leak
          insertCounterApiAnalogTable01++;

          // RoSchmi, Todo: event. include code to check for memory leaks here

          // Store Entity to Azure Cloud   
          __unused az_http_status_code insertResult =  insertTableEntity(myCloudStorageAccountPtr, myX509Certificate, (char *)augmentedAnalogTableName.c_str(), analogTableEntity, (char *)EtagBuffer);
        }
        #pragma endregion
        
        #pragma region if (dataContainer.hasToBeSent())
        if (dataContainer.hasToBeSent())   // have to send analog values read by Device (e.g. noise)?
        {
          //Serial.printf("\n###### AiOnTheEdge dataContainer has to be sent\n");
          Serial.println(F("\n###### AiOnTheEdge dataContainer has to be sent to Azure\n"));        
          // Retrieve edited sample values from container
          SampleValueSet sampleValueSet = dataContainer.getCheckedSampleValues(dateTimeUTCNow, true);
          createSampleTime(sampleValueSet.LastUpdateTime, timeZoneOffsetUTC, (char *)sampleTime);
          
          // Define name of the table (arbitrary name + actual year, like: AnalogTestValues2020)
          String augmentedAnalogTableName = analogTableName;
          String augmentedAnalogDaysTableName = analogTableName;
          augmentedAnalogDaysTableName += "Days";
          if (augmentTableNameWithYear)
          {
            
            augmentedAnalogTableName += (localTime.year());
            augmentedAnalogDaysTableName += (localTime.year());
          }
          
          // Create Azure Storage Tables if tables don't exist
          if (localTime.year() != dataContainer.Year)    // if new year          
          {  
            az_http_status_code respCode = createTable(myCloudStorageAccountPtr, myX509Certificate, (char *)augmentedAnalogTableName.c_str());
                     
            if ((respCode == AZ_HTTP_STATUS_CODE_CONFLICT) || (respCode == AZ_HTTP_STATUS_CODE_CREATED))
            {
              dataContainer.Set_Year(localTime.year());                   
            }
            else
            {
              // eventually reset board if not successful                         
            }
            // Create a second table for consumption of days
            respCode = createTable(myCloudStorageAccountPtr, myX509Certificate, (char *)augmentedAnalogDaysTableName.c_str());
            if ((respCode == AZ_HTTP_STATUS_CODE_CONFLICT) || (respCode == AZ_HTTP_STATUS_CODE_CREATED))
            {
              dataContainer.Set_Year(localTime.year());                   
            }
            else
            {
              // eventually reset board if not successful                         
            }
          }         
          // Create an Array of (here) 5 Properties
          // Each Property consists of the Name, the Value and the Type (here only Edm.String is supported)

          // Besides PartitionKey and RowKey we have 5 properties to be stored in a table row
          // (SampleTime and 4 samplevalues)
          const size_t analogPropertyCount = 5;
          EntityProperty AnalogPropertiesArray[analogPropertyCount];
          AnalogPropertiesArray[0] = (EntityProperty)TableEntityProperty((char *)"SampleTime", (char *) sampleTime, (char *)"Edm.String");

          #if ANALOG_SENSORS_USE_AVERAGE == 1
          AnalogPropertiesArray[1] = (EntityProperty)TableEntityProperty((char *)"T_1", (char *)floToStr(sampleValueSet.SampleValues[0].AverageValue / 10).c_str(), (char *)"Edm.String");
          AnalogPropertiesArray[2] = (EntityProperty)TableEntityProperty((char *)"T_2", (char *)floToStr(sampleValueSet.SampleValues[1].AverageValue).c_str(), (char *)"Edm.String");
          AnalogPropertiesArray[3] = (EntityProperty)TableEntityProperty((char *)"T_3", (char *)floToStr(sampleValueSet.SampleValues[2].AverageValue).c_str(), (char *)"Edm.String");
          AnalogPropertiesArray[4] = (EntityProperty)TableEntityProperty((char *)"T_4", (char *)floToStr(sampleValueSet.SampleValues[3].AverageValue).c_str(), (char *)"Edm.String");
          #else
          AnalogPropertiesArray[1] = (EntityProperty)TableEntityProperty((char *)"T_1", (char *)floToStr(sampleValueSet.SampleValues[0].Value / 10).c_str(), (char *)"Edm.String");
          AnalogPropertiesArray[2] = (EntityProperty)TableEntityProperty((char *)"T_2", (char *)floToStr(sampleValueSet.SampleValues[1].Value).c_str(), (char *)"Edm.String");
          AnalogPropertiesArray[3] = (EntityProperty)TableEntityProperty((char *)"T_3", (char *)floToStr(sampleValueSet.SampleValues[2].Value).c_str(), (char *)"Edm.String");
          AnalogPropertiesArray[4] = (EntityProperty)TableEntityProperty((char *)"T_4", (char *)floToStr(sampleValueSet.SampleValues[3].Value).c_str(), (char *)"Edm.String");
          #endif

          // Create the PartitionKey (special format)
          makePartitionKey(analogTablePartPrefix, augmentPartitionKey, localTime, partitionKey, &partitionKeyLength);
          partitionKey = az_span_slice(partitionKey, 0, partitionKeyLength);

          // Create the RowKey (special format)        
          makeRowKey(localTime, rowKey, &rowKeyLength);
          
          rowKey = az_span_slice(rowKey, 0, rowKeyLength);
  
          // Create TableEntity consisting of PartitionKey, RowKey and the properties named 'SampleTime', 'T_1', 'T_2', 'T_3' and 'T_4'
          AnalogTableEntity analogTableEntity(partitionKey, rowKey, az_span_create_from_str((char *)sampleTime),  AnalogPropertiesArray, analogPropertyCount);
          
          #if SERIAL_PRINT == 1
            Serial.printf("Trying to insert %u \r\n", insertCounterAnalogTable);
            Serial.printf("Analog Table Name: %s \r\n\n", (const char *)augmentedAnalogTableName.c_str()); 
          #endif
             
          // Keep track of tries to insert and check for memory leak
          insertCounterAnalogTable++;

          // RoSchmi, Todo: event. include code to check for memory leaks here

          // Store Entity to Azure Cloud
             
          __unused az_http_status_code insertResult =  insertTableEntity(myCloudStorageAccountPtr, myX509Certificate, (char *)augmentedAnalogTableName.c_str(), analogTableEntity, (char *)EtagBuffer);
          
          // have to write new row in ...Days Table
          if (maxLastDayGasConsumption.isValid)
          {
            
            // Create the PartitionKey (special format)          
            TimeSpan oneDay(1,0,0,0);
            // make PartitionKey, correct for the last day
            makePartitionKey(analogTablePartPrefix, augmentPartitionKey, localTime.operator-(oneDay), partitionKey, &partitionKeyLength);
            partitionKey = az_span_slice(partitionKey, 0, partitionKeyLength);

            // Create the RowKey (special format)
            // make RowKey, correct for the last day
            //TimeSpan oneSecond(0,0,0,1);
            int offsetHours = timeZoneOffsetUTC / 60;
            int offsetMinutes = timeZoneOffsetUTC % 60; 
            TimeSpan spanOffsetUtc(0, offsetHours, offsetMinutes, 0);
            TimeSpan spanToEndOfDay(0,23,59,59);
            
            //String todayDate = localTime.timestamp(DateTime::TIMESTAMP_DATE);
            //DateTime beginOfToday(todayDate.c_str());

            makeRowKey(localTime, rowKey, &rowKeyLength);
            rowKey = az_span_slice(rowKey, 0, rowKeyLength);
            
            String SecondToLastUpdateDate = sampleValueSet.SecondToLastUpdateTime.timestamp(DateTime::TIMESTAMP_DATE);
            //todayDate = sampleValueSet.LastUpdateTime.timestamp(DateTime::TIMESTAMP_DATE);
            

            DateTime startOfSecondToLastUpdateDate(SecondToLastUpdateDate.c_str());

            
