RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
              // Serial.printf("OnOff Table Name: %s \r\n\n", (const char *)augmentedOnOffTableName.c_str());
              // Store Entity to Azure Cloud   
             __unused az_http_status_code insertResult =  insertTableEntity(myCloudStorageAccountPtr, myX509Certificate, (char *)augmentedOnOffTableName.c_str(), onOffTableEntity, (char *)EtagBuffer);
              
              delay(1000);     // wait at least 1 sec so that two uploads cannot have the same RowKey

              break;          // Send only one in each round of loop
              }
              else
              {
                if (isLast15SecondsOfDay && !onOffValueSet.OnOffSampleValues[i].dayIsLocked)
                {
                  if (onOffValueSet.OnOffSampleValues[i].actState == true)              
                  {               
                    onOffDataContainer.Set_ResetToOnIsNeededFlag(i, true);                 
                    onOffDataContainer.SetNewOnOffValue(i, onOffValueSet.OnOffSampleValues[i].inputInverter ? true : false, dateTimeUTCNow, timeZoneOffsetUTC);
                    delay(1000);   // because we don't want to send twice in the same second 
                    break;
                  }
                else
                {              
                  if (onOffValueSet.OnOffSampleValues[i].resetToOnIsNeeded)
                  {                  
                    onOffDataContainer.Set_DayIsLockedFlag(i, true);
                    onOffDataContainer.Set_ResetToOnIsNeededFlag(i, false);
                    onOffDataContainer.SetNewOnOffValue(i, onOffValueSet.OnOffSampleValues[i].inputInverter ? false : true, dateTimeUTCNow, timeZoneOffsetUTC);
                    break;
                  }                 
                }              
              }
              } 
            }                                
          }               
        }
        #pragma endregion       
      }
      #pragma endregion          
  } 
}  // end of Loop()
#pragma endregion


#pragma region Function ReadAnalogSensorStruct_01(int pSensorIndex)
ValueStruct ReadAnalogSensorStruct_01(int pSensorIndex)
{ 
  ValueStruct returnValueStruct = { 
      .displayValue = (float)MAGIC_NUMBER_INVALID,
      .unClippedValue = (float)MAGIC_NUMBER_INVALID,
      .thisDayBaseValue = (float)MAGIC_NUMBER_INVALID};

  char consumption[12] = {'\0'};

  switch(pSensorIndex)
  {
      case 0:
      { 
        // Total Consumption, DisplayValue and UnClippedValue 
        // select Feature by its name (pSensorName value, raw, pre, error, rate, timestamp)
              
        const int decShiftFactor = 10;   // defines shift of decimal point (10 means 1 place)

        AiOnTheEdgeApiSelection::Feature selectedFeature;
        
        #pragma region  (is FirstGasmeterRead)
        if (isFirstGasmeterRead)
        {
          // Read raw instead of value
          selectedFeature = ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, &gasmeterApiAccount, (const char *)"raw", gasmeterApiSelectionPtr);                  
          char preValue[12] = {'\0'};
               
          strncpy(preValue, (const char *)selectedFeature.value, sizeof(preValue) -1);
          preValue[sizeof(preValue) -1] = '\0';
          
          //Serial.printf("Raw-value read was: %s\n", preValue);
          
          if (strcmp((char *)preValue, (char *)"999.9") != 0)
          {
            float preValueFloat = atof(preValue);
            float preValueFloatMinus = preValueFloat - 0.1f;
            snprintf(preValue, sizeof(preValue), "%.2f", preValueFloatMinus);             
            t_httpCode httpResponse = setAiPreValueViaRestApi((const char*)"dummyCaCert", &gasmeterApiAccount, (const char *)preValue);
            if (httpResponse == t_http_codes::HTTP_CODE_OK)
            {
              isFirstGasmeterRead = false;

              //if (true)
              if (!LittleFS.exists(PERSIST_FILE))
              {
                // Create file if not existing               
                strcpy(first_Reading.localTimestamp, (const char*)localTime.timestamp().c_str());
                first_Reading.timeZoneOffsetUTC = myTimezone.utcIsDST(dateTimeUTCNow.unixtime()) ? TIMEZONEOFFSET + DSTOFFSET : TIMEZONEOFFSET;                
                first_Reading.gas_DayBaseValue = preValueFloat * decShiftFactor;
                first_Reading.gas_overflowCount = 0;
                first_Reading.water_DayBaseValue = 0;
                first_Reading.water_overflowCount = 0;
                first_Reading.checksum = calcChecksum( (uint8_t*) &first_Reading, sizeof(first_Reading) - sizeof(first_Reading.checksum) );                   
                File file = FileFS.open(PERSIST_FILE, "w");
                if (file)
                {
                  file.write((uint8_t*) &first_Reading, sizeof(first_Reading));
                  file.close();
                }                
              }  // End of creating not existing PERSIST_FILE

              File file = FileFS.open(PERSIST_FILE, "r");
              // Set content of the struct to 0
              memset((void *) &first_Reading,       0, sizeof(first_Reading));
              if (file)
              {
                file.readBytes((char *) &first_Reading, sizeof(first_Reading));
                file.close();
                DateTime firstReadingDateTime((const char *)first_Reading.localTimestamp);
                DateTime localTimeDateTime((const char *)localTime.timestamp().c_str());   // Created for debugging
                
                //Serial.printf("In: isFirstGasmeterRead, Dates: %s,  %s\n", (const char *)first_Reading.localTimestamp, (const char *)localTime.timestamp().c_str());
                  
                // if we have a new day --> write first_Reading, otherwise -->leave the old one
                if (firstReadingDateTime.timestamp(DateTime::TIMESTAMP_DATE) != localTimeDateTime.timestamp(DateTime::TIMESTAMP_DATE))       
                {
                  Serial.println("Was new day");
                  Serial.println("Presetting an writing new first_Reading values");
                  strcpy(first_Reading.localTimestamp, (const char*)localTime.timestamp().c_str());
                  first_Reading.timeZoneOffsetUTC = myTimezone.utcIsDST(dateTimeUTCNow.unixtime()) ? TIMEZONEOFFSET + DSTOFFSET : TIMEZONEOFFSET;
                  first_Reading.gas_DayBaseValue = preValueFloat * decShiftFactor;
                  first_Reading.gas_overflowCount = 0;
                  first_Reading.water_DayBaseValue = 0;
                  first_Reading.water_overflowCount = 0;
                  first_Reading.checksum = calcChecksum( (uint8_t*) &first_Reading, sizeof(first_Reading) - sizeof(first_Reading.checksum) );                   
                  
                  File file = FileFS.open(PERSIST_FILE, "w");
                  if (file)
                  {
                    file.write((uint8_t*) &first_Reading, sizeof(first_Reading));                                
                    file.close();
                  }
                  file = FileFS.open(PERSIST_FILE, "r");
                  // Set content of the struct to 0
                  memset((void *) &first_Reading,       0, sizeof(first_Reading));
                  if (file)
                  {
                    file.readBytes((char *) &first_Reading, sizeof(first_Reading));                   
                    file.close();
                  }
                }            
              }
              else
              {
                Serial.println("Error reading PERSIST_FILE");
              }
            }   // (httpResponse == t_http_codes::HTTP_CODE_OK)
          }   
        }
        #pragma endregion
        else   // not FirstGasmeterRead
        {
        #pragma region (is not FirstGasmeterRead)

          selectedFeature = ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, &gasmeterApiAccount,(const char *)"value", gasmeterApiSelectionPtr);
          // if we have a new day --> write first_Reading, otherwise -->leave the old one
          DateTime storedFirstReadingDateTime((const char *)first_Reading.localTimestamp);
          
          
          /******* for debugging */
          GasmeterReadCounter++;   // to be deleted later
          
          TimeSpan diffDay(0,0,0,0);
          TimeSpan oneDay(1,0,0,0);

          if (GasmeterReadCounter == 1)
          {
            // diffDay = oneDay;     // normally has to be commented out
          }

          /******* end for debugging */
         
          DateTime firstReadingDateTime = storedFirstReadingDateTime.operator-(diffDay); // commented, only for debugging
          DateTime localTimeDateTime((const char *)localTime.timestamp().c_str());   // Created for debugging               
          
          //Serial.printf("In: is not FirstGasmeterRead, Dates: %s,  %s\n", (const char *)first_Reading.localTimestamp, (const char *)localTime.timestamp().c_str());
                  
