RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
          // if new day (is not FirstGasmeterRead)
          if (firstReadingDateTime.timestamp(DateTime::TIMESTAMP_DATE) != localTimeDateTime.timestamp(DateTime::TIMESTAMP_DATE))
          {
             Serial.println("Was new day");
            strncpy(consumption, selectedFeature.value, sizeof(consumption));
            Serial.printf("Consumption: %s\n", (const char *)consumption);
            Serial.printf("LastGasmeterReading: %.1f\n", LastGasmeterReading);
            
            float tempNumber = (float)MAGIC_NUMBER_INVALID;

            if (isValidFloat(consumption) && strlen(consumption) > strlen("0.00"))
            {
              maxLastDayGasConsumption.isValid = true;              
              maxLastDayGasConsumption.dayConsumption = LastGasmeterDayConsumption;
              maxLastDayGasConsumption.totalConsumption = LastGasmeterReading;
              
              Serial.println("Preset new first_Reading values");
              tempNumber = atof(consumption);
              strcpy(first_Reading.localTimestamp, (const char*)localTime.timestamp().c_str());
              first_Reading.timeZoneOffsetUTC = myTimezone.utcIsDST(dateTimeUTCNow.unixtime()) ? TIMEZONEOFFSET + DSTOFFSET : TIMEZONEOFFSET;
              first_Reading.gas_DayBaseValue = LastGasmeterReading;              
              first_Reading.gas_overflowCount = 0;
              first_Reading.water_DayBaseValue = 0;
              first_Reading.water_overflowCount = 0;
              first_Reading.checksum = calcChecksum( (uint8_t*) &first_Reading, sizeof(first_Reading) - sizeof(first_Reading.checksum) );                   
              
              
              Serial.printf("Setting gas_DayBaseValue to %.1f\n", LastGasmeterReading);
              File file = FileFS.open(PERSIST_FILE, "w");
              if (file)
              {
                file.write((uint8_t*) &first_Reading, sizeof(first_Reading));                                
                file.close();
              }
              file = FileFS.open(PERSIST_FILE, "r");
                // Set content of the struct to 0
              memset((void *) &first_Reading,       0, sizeof(first_Reading));
              if (file)
              { 
                file.readBytes((char *) &first_Reading, sizeof(first_Reading));                   
                file.close();
              }              
            }
            else
            { 
              maxLastDayGasConsumption.isValid = false;
              maxLastDayGasConsumption.totalConsumption = 0.0f;
              maxLastDayGasConsumption.dayConsumption = 0.0f;
            }         
          }
        #pragma endregion         
        }
        
        //Serial.println("Read value (1)");
        memset((void *) &consumption,       '\0', sizeof(consumption));
        strncpy(consumption, selectedFeature.value, sizeof(consumption));                                          
     
        float tempNumber = (float)MAGIC_NUMBER_INVALID;
        
        //Serial.println("Read value (2)");
        //Serial.printf("writing consumption: %s Length: %d\n", (const char *)consumption, strlen(consumption));
         
        if (isValidFloat(consumption) && strlen(consumption) > strlen("0.00"))
        {
          tempNumber = atof(consumption);
          #if SERIAL_PRINT == 1
            Serial.printf("\nString could be parsed to float: %s StringLength: %d\n", consumption, strlen(consumption));
          #endif
        }
        else
        {
          Serial.printf("Value invalid (0.00) or could not be parsed to float: %s\n", consumption);
          tempNumber = (float)MAGIC_NUMBER_INVALID;

          Serial.println("Read value (2)");    
        }
        
        // convert values near MAGIC_NUMBER_INVALID to MAGIC_NUMBER_INVALID  
        tempNumber = (tempNumber > (float)MAGIC_NUMBER_INVALID - 0.01 && tempNumber < (float)MAGIC_NUMBER_INVALID + 0.01) ? (float)MAGIC_NUMBER_INVALID: tempNumber;
        
        //Serial.println("Read value (3)");

        if (tempNumber > (MAGIC_NUMBER_INVALID - 0.01) && tempNumber < (MAGIC_NUMBER_INVALID + 0.01))
        {
          // if tempNumber = MAGIC_NUMBER_INVALID return both with MAGIC_NUMBER_INVALID
          // (was preset at the beginning)
          // this means, that the values are ignored in further process
          return returnValueStruct;
        }

        //Serial.println("Read value (4)");

        // multply by 10, so that there remains 1 significant digit after decimal point
        sprintf(consumption, "%.1f", tempNumber * decShiftFactor);
        LastGasmeterReading = atof((const char *)consumption);
        returnValueStruct.unClippedValue = LastGasmeterReading;  
        
        // remove leading digits, so that there are maximal 2 digits 
        // before decimal point for .displayValue
        while (strlen(consumption) > 4)
        {
            memmove(consumption, consumption + 1, strlen(consumption));
        }
        returnValueStruct.displayValue = atof((const char *)consumption);
        
        returnValueStruct.thisDayBaseValue = first_Reading.gas_DayBaseValue;
        
        //Serial.println("Read value (5)");

        //#if SERIAL_PRINT == 1
           Serial.printf("\nDisplayValue: %.1f  UnClippedValue: %.1f\n", returnValueStruct.displayValue, returnValueStruct.unClippedValue);
        //#endif
        
      }
      break;                   
      case 1:    // Consumption this day
      {
        // Calculate Day-Consumption from BaseValue and UnClippedValue 
        float copyBaseValue = dataContainer.SampleValues[0].BaseValue;
        float copyUnClippedValue = dataContainer.SampleValues[0].UnClippedValue;
        uint32_t LastSendTimeSeconds = dataContainer._lastSentTime.secondstime();
        uint32_t timeSinceLastSendSeconds = dateTimeUTCNow.secondstime() - LastSendTimeSeconds;
                 
        if (copyBaseValue <= copyUnClippedValue)
        {        
          LastGasmeterDayConsumption = (copyUnClippedValue - copyBaseValue);
          returnValueStruct.displayValue = LastGasmeterDayConsumption;
        }
        else
        {
          // Overflow of copyUnClippedValue has occured
          int preDecimalPoint = (int)copyBaseValue;
          int oneMoreDigit =  pow(10,(int)log10(preDecimalPoint) + 1);
          
            LastGasmeterDayConsumption = copyUnClippedValue + (oneMoreDigit - copyBaseValue);
           
        
          returnValueStruct.displayValue = LastGasmeterDayConsumption;
        }
              
        returnValueStruct.unClippedValue = copyUnClippedValue;
        if (timeSinceLastSendSeconds > dataContainer.SendInterval.totalseconds() -3)
        {                      
          Serial.printf("\nCase 1: Day-Consumption: %.1f\n", returnValueStruct.displayValue);
        }                      
      }
      break;
      case 2:   // rate
      {
        uint32_t sendIntervalSeconds = dataContainer.SendInterval.totalseconds();
        uint32_t LastSendTimeSeconds = dataContainer._lastSentTime.secondstime();       
        
