RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
        float copyLastSendUnClippedValue = dataContainer.SampleValues[0].LastSendUnClippedValue;
        float copyUnClippedValue = dataContainer.SampleValues[0].UnClippedValue;                    
        uint32_t timeSinceLastSendSeconds = dateTimeUTCNow.secondstime() - LastSendTimeSeconds;
             
          // Only print the last messages
          if (timeSinceLastSendSeconds > dataContainer.SendInterval.totalseconds() -3)
          {
            Serial.printf("LastSendTime: %d Actual: %.d Diff: %d Interval: %d Remain %d\n", LastSendTimeSeconds,  
            dateTimeUTCNow.secondstime(), dateTimeUTCNow.secondstime() - LastSendTimeSeconds, sendIntervalSeconds, 
            LastSendTimeSeconds + sendIntervalSeconds - dateTimeUTCNow.secondstime());
          }
   
        float valueDiffOverflowCorrected = 0;

        if (copyLastSendUnClippedValue <= copyUnClippedValue)
        {
          //Serial.println("No Overflow");
          valueDiffOverflowCorrected = (copyUnClippedValue - copyLastSendUnClippedValue);
        }
        else
        {
          // Overflow of copyUnClippedValue has occured
          Serial.println("Overflow of unclipped value, performed needed calculations");
          int preDecimalPoint = (int)copyLastSendUnClippedValue;
          int oneMoreDigit =  pow(10,(int)log10(preDecimalPoint) + 1);  
          valueDiffOverflowCorrected = copyUnClippedValue + (oneMoreDigit - copyLastSendUnClippedValue);
        }  
        
        float rate = 0.0;

        if (valueDiffOverflowCorrected != 0.0f)
        {
            if (timeSinceLastSendSeconds > 1.0)
            {             
              rate = valueDiffOverflowCorrected * 10.0f / ((float)timeSinceLastSendSeconds / 60.0f); // *10 gives reasonable size in graph        
            }
        }
          // RoSchmi
          // Only print the last messages
          if (timeSinceLastSendSeconds > dataContainer.SendInterval.totalseconds() -3)
          {
            Serial.printf("LastSendValue: %.1f Actual: %.1f Diff: %.1f Seconds: %d\n", copyLastSendUnClippedValue, 
            copyUnClippedValue, copyUnClippedValue - copyLastSendUnClippedValue, timeSinceLastSendSeconds);  
          
            Serial.printf("\nCase 2: Flow is: %.1f per minute. Read after: %d seconds\n\n", rate, timeSinceLastSendSeconds);
          }
          // Neglect (set to MAGIC_NUMBER_INVALID when timeSinceLastSendSeconds < 5 sec)
          returnValueStruct.displayValue = timeSinceLastSendSeconds > 5 ? rate : (float)MAGIC_NUMBER_INVALID;
          returnValueStruct.unClippedValue = copyUnClippedValue;                              
      }
      break;
      case 3:
      {

          // in the forth graph show Viessmann Vorlauftemperatur
          
          //SampleValueSet featureValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, false);         
          //returnValueStruct.displayValue = featureValueSet.SampleValues[1].Value;
          //returnValueStruct.unClippedValue = returnValueStruct.displayValue;
                     
          // This is an alternative way to get a Viessmann Api Sensor valu                      
          
          //SampleValueSet featureValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, false);         
          //theRead = featureValueSet.SampleValues[1].Value;
          
                      
          //theRead = atoi((char *)sSwiThresholdStr) / 10; // dummy
          //Show ascending lines from 0 to 5, so re-boots of the board are indicated                                                
          //theRead = ((double)(insertCounterAnalogTable % 50)) / 10;
          returnValueStruct.displayValue = ((float)(insertCounterAnalogTable % 50)) / 10;
          returnValueStruct.unClippedValue = 0.0;                      
      }                   
      break;
    }
  //}
    //Serial.printf("The Vi-Lastreadtime (2): %u\n", viessmannApiSelectionPtr_01 ->lastReadTimeSeconds);
    //Serial.printf("Returning returnValueStruct %.1f %.1f\n", returnValueStruct.displayValue, returnValueStruct.unClippedValue);
    return returnValueStruct;
}
#pragma endregion

#pragma region Routine ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, * pRestApiAccount, const char* pSensorName, * pAiOnTheEdgeApiSelectionPtr)
AiOnTheEdgeApiSelection::Feature ReadAiOnTheEdgeApi_Analog_01(int pSensorIndex, RestApiAccount * pRestApiAccount, const char* pSensorName, AiOnTheEdgeApiSelection * pAiOnTheEdgeApiSelectionPtr)
{
  // Use values read from the AiOnTheEdge Rest API
  // pSensorIndex determins the line chart (No. 0 to No. 3) to be displayed.
  // pRestApiAccount contains the url and the scheme to be used in the http-request to get the desired data
  // pSensorName is the name of the feature to be selected (value, raw, error etc.) (see AiOnTheEdgeSelection.h)

  AiOnTheEdgeApiSelection::Feature returnFeature;
  returnFeature.idx = 0;
  strncpy(returnFeature.name, (const char *)"", sizeof(returnFeature.name) -1);
  strncpy(returnFeature.timestamp, (const char *)"", sizeof(returnFeature.timestamp) -1);

  // Set value to MAGIC_NUMBER_INVALID. This value is ignored in the following process
  strncpy(returnFeature.value, (floToStr(MAGIC_NUMBER_INVALID)).c_str(), sizeof(returnFeature.value) - 1);
  
  // Save lastReadTimeSeconds and readIntervalSeconds
  int64_t tempLastReadTimeSeconds = pAiOnTheEdgeApiSelectionPtr -> lastReadTimeSeconds;
  int32_t tempReadIntervalSeconds = pAiOnTheEdgeApiSelectionPtr ->readIntervalSeconds;
  
  // Only read features from AiOnTheEdgeDevice when readInterval has expired
  
  int64_t utcNowSecondsTime = (int64_t)dateTimeUTCNow.secondstime();
   
  int64_t remaining_Ai_Seconds = ((tempLastReadTimeSeconds + tempReadIntervalSeconds) - utcNowSecondsTime);
  
  //Serial.printf("(Ai) LastReadTime: %d Interval: %d Now: %d\n", (int32_t)tempLastReadTimeSeconds, tempReadIntervalSeconds,  (int32_t)utcNowSecondsTime);

  Serial.printf("Remaining seconds (Ai): %d\n", (int32_t)remaining_Ai_Seconds);
  
