RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
  // if ReadInterval has expired, --> readJsonFromRestApi
  if ((tempLastReadTimeSeconds + tempReadIntervalSeconds) < utcNowSecondsTime)  
  {
    char myUriEndpoint[50] = {0};
    strncpy(myUriEndpoint, (const char *)(pRestApiAccount ->UriEndPointJson).c_str(), sizeof(myUriEndpoint) - 1);
    
    t_httpCode httpResponseCode = readJsonFromRestApi(myX509Certificate, pRestApiAccount, pAiOnTheEdgeApiSelectionPtr);   
     
    if (httpResponseCode > 0)
    {
      pAiOnTheEdgeApiSelectionPtr ->lastReadTimeSeconds = (int64_t)dateTimeUTCNow.secondstime();          
    
      if (httpResponseCode == t_http_codes::HTTP_CODE_OK)
      {
        //Serial.println("Success to read Features from Ai-On-The-Edge");       
      }
      else
      {
        Serial.printf("Failed to read Features: ResponseCode: %d\n", httpResponseCode); 
        Serial.println((char*)bufferStorePtr);
      }
    }
    else
    {
      Serial.printf("Failed reading from Ai-On-The-Edge-Device, httpCode: %d\n", httpResponseCode); 
    }
  }
 
  if (analogSensorMgr_Ai_01.HasToBeRead(pSensorIndex, dateTimeUTCNow, true))
  {
    for (int i = 0; i < AI_FEATURES_COUNT; i++)
    {       
      if (strcmp((const char *)ai_features[i].name, pSensorName) == 0)
      {       
        returnFeature = ai_features[i];

        Serial.printf("\nanalogSensorMgr_Ai_01: Value is used. Index: %d Value: %s\n", pSensorIndex, returnFeature.value);
        
        analogSensorMgr_Ai_01.SetReadTimeAndValues(pSensorIndex, dateTimeUTCNow, atof(returnFeature.value), 0.0f, MAGIC_NUMBER_INVALID);                         
        break;
      }     
    } 
  } 
  return returnFeature;
}
#pragma endregion

#pragma region Routine readJsonFromRestApi(pCaCert, *pRestApiAccount, *apiSelectionPtr)
t_httpCode readJsonFromRestApi(X509Certificate pCaCert, RestApiAccount * pRestApiAccount , AiOnTheEdgeApiSelection * apiSelectionPtr)
{
  WiFiClient * selectedClient = pRestApiAccount ->UseHttps ? &secure_wifi_client : &plain_wifi_client;
  
  if (pRestApiAccount -> UseHttps && !(pRestApiAccount -> UseCaCert))
  {
    secure_wifi_client.setInsecure();
  }

  int64_t tempLastReadTimeSeconds = apiSelectionPtr ->lastReadTimeSeconds;
  int32_t tempReadIntervalSeconds = apiSelectionPtr ->readIntervalSeconds;

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  memset(bufferStorePtr, '\0', bufferStoreLength);

  char url[70] = {'\0'};
  strncpy(url, (const char *)((pRestApiAccount -> UriEndPointJson).c_str()), sizeof(url) - 1);
  Serial.printf("readJsonFromRestApi: %s\n", (const char *)url);
  
  AiOnTheEdgeClient aiOnTheEdgeClient(pRestApiAccount, (const char*)"dummyCaCert", httpPtr, selectedClient);

  Serial.printf("\r\n(%u) ", loadGasMeterJsonCount);
  Serial.printf("%i/%02d/%02d %02d:%02d \n", localTime.year(), 
                                        localTime.month() , localTime.day(),
                                        localTime.hour() , localTime.minute());
   
  
  int64_t tempLast_Vi_ReadTimeSeconds = viessmannApiSelectionPtr_01 ->lastReadTimeSeconds;
  int32_t temp_Vi_ReadIntervalSeconds = viessmannApiSelectionPtr_01 ->readIntervalSeconds;
  
  t_httpCode responseCode = aiOnTheEdgeClient.GetFeatures((const char *)url, bufferStorePtr, bufferStoreLength, apiSelectionPtr);
  
  // Serial.printf("LastReadTime in Hex: %x\n", viessmannApiSelectionPtr_01 ->lastReadTimeSeconds);
  

  //Restore
  //viessmannApiSelectionPtr_01 ->lastReadTimeSeconds = tempLast_Vi_ReadTimeSeconds;
  //viessmannApiSelectionPtr_01 ->readIntervalSeconds = temp_Vi_ReadIntervalSeconds;
  
  loadGasMeterJsonCount++;
  
  if (responseCode == t_http_codes::HTTP_CODE_OK)
  {
    // Populate features array and replace the name read from Api
    // with the special names used in this Application
    
    ai_features[0] = apiSelectionPtr ->_0_value;
    ai_features[1] = apiSelectionPtr ->_1_raw;
    ai_features[2] = apiSelectionPtr ->_2_pre;
    ai_features[3] = apiSelectionPtr ->_3_error;
    ai_features[4] = apiSelectionPtr ->_4_rate;
    ai_features[5] = apiSelectionPtr ->_5_timestamp;
  }
  else
  {
    
    ai_features[0] = apiSelectionPtr ->_0_value;
    ai_features[1] = apiSelectionPtr ->_1_raw;
    ai_features[2] = apiSelectionPtr ->_2_pre;
    ai_features[3] = apiSelectionPtr ->_3_error;
    ai_features[4] = apiSelectionPtr ->_4_rate;
    ai_features[5] = apiSelectionPtr ->_5_timestamp;
    
    Serial.printf("Request from REST-Api failed: Code: %d Substitution: %s \n", responseCode, ai_features[0].value);
  }
  return responseCode;
}
#pragma endregion

#pragma region Routine ReadViessmannApi_Analog_01(pSensorIndex, const char* pSensorName, * pViessmannApiSelectionPtr)
ViessmannApiSelection::Feature ReadViessmannApi_Analog_01(int pSensorIndex, const char* pSensorName, ViessmannApiSelection * pViessmannApiSelectionPtr)
{
  
  // Use values read from the Viessmann API
  // pSensorIndex determins the position (from 4). pSensorName is the name of the feature (see ViessmannApiSelection.h)
  
  // preset a 'returnFeature' with value = MAGIC_NUMBER_INVALID (999.9)
  // Save lastReadTimeSeconds and readIntervalSeconds
  int64_t tempLastReadTimeSeconds = pViessmannApiSelectionPtr -> lastReadTimeSeconds;
  int32_t tempReadIntervalSeconds = pViessmannApiSelectionPtr ->readIntervalSeconds;
 
  ViessmannApiSelection::Feature returnFeature;
  strncpy(returnFeature.value, (floToStr(MAGIC_NUMBER_INVALID)).c_str(), sizeof(returnFeature.value) - 1);
  
  
   
  int64_t utcNowSecondsTime = (int64_t)dateTimeUTCNow.secondstime();
  int64_t remaining_Vi_seconds = tempLastReadTimeSeconds + tempReadIntervalSeconds - utcNowSecondsTime;
  
  if (pSensorIndex == 0)
  {
    Serial.printf("Remaining seconds to read (Vi): %d\n",  (int32_t)remaining_Vi_seconds);
  }

  // Only read features from the cloud when readInterval has expired
  if ((tempLastReadTimeSeconds + tempReadIntervalSeconds) < utcNowSecondsTime) 
  { 
      Serial.println(F("########## Have to read Vi-Features #########\n"));
      
      t_httpCode httpCode = read_Vi_FeaturesFromApi(myX509Certificate, myViessmannApiAccountPtr, Data_0_Id, Gateways_0_Serial, Gateways_0_Devices_0_Id, pViessmannApiSelectionPtr);
         
      if (httpCode == t_http_codes::HTTP_CODE_OK)
      {
        pViessmannApiSelectionPtr ->lastReadTimeSeconds = utcNowSecondsTime;
        
        Serial.println(F("Succeeded to read Features from Viessmann Cloud\n"));
        
        //Serial.printf("OK-Vi-LastReadTime: %u dateTimeUTCNow: %u, Interval: %u\n", (uint32_t)pViessmannApiSelectionPtr ->lastReadTimeSeconds, dateTimeUTCNow.secondstime(), pViessmannApiSelectionPtr ->readIntervalSeconds); 
      }
      else
      {
        pViessmannApiSelectionPtr ->lastReadTimeSeconds = utcNowSecondsTime;
         
        Serial.println(F("Failed to read Features from Viessmann Cloud"));
        Serial.printf("Else-LastReadTime: %u dateTimeUTCNow: %u, Interval: %u\n", (uint32_t)viessmannApiSelection_01.lastReadTimeSeconds, dateTimeUTCNow.secondstime(), (uint32_t)viessmannApiSelection_01.readIntervalSeconds); 
        //Serial.println((char*)bufferStorePtr);
       } 
  }
  
  if (analogSensorMgr_Vi_01.HasToBeRead(pSensorIndex, dateTimeUTCNow))
  {     
    for (int i = 0; i < VI_FEATURES_COUNT; i++)
    {       
      if (strcmp((const char *)features[i].name, pSensorName) == 0)
      {
        returnFeature = features[i];
        analogSensorMgr_Vi_01.SetReadTimeAndValues(pSensorIndex, dateTimeUTCNow, atof(returnFeature.value), 0.0f, MAGIC_NUMBER_INVALID);           
        break;
      }
    } 
  } 
  return returnFeature;
}
#pragma endregion

