RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
#pragma region Routine read_Vi_FeaturesFromApi(...)
t_httpCode read_Vi_FeaturesFromApi(X509Certificate pCaCert, ViessmannApiAccount * pViessmannApiAccountPtr, const uint32_t data_0_id, const char * p_gateways_0_serial, const char * p_gateways_0_devices_0_id, ViessmannApiSelection * apiSelectionPtr)
{
  WiFiClient * selectedClient = (pViessmannApiAccountPtr -> UseHttps) ? &secure_wifi_client : &plain_wifi_client;
  //Serial.printf("Have selected Client \n");
  if ((pViessmannApiAccountPtr -> UseHttps) && !(pViessmannApiAccountPtr -> UseCaCert))
  {
    secure_wifi_client.setInsecure();
    //Serial.println("Setting Viessmann Client insecure\n");
  }

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  int64_t tempLastReadTimeSeconds = apiSelectionPtr -> lastReadTimeSeconds;
  int32_t tempReadIntervalSeconds = apiSelectionPtr ->readIntervalSeconds;
  //ViessmannApiSelection tempViessmannApiSelection(tempLastReadTimeSeconds, tempReadIntervalSeconds);
  
  //ViessmannApiSelection * apiSelectionPtr = &tempViessmannApiSelection;
  
  memset(bufferStorePtr, '\0', bufferStoreLength);
  
  
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, selectedClient, bufferStorePtr);
  


  Serial.printf("\r\n(%u) ",loadViFeaturesCount);
  Serial.printf("%i/%02d/%02d %02d:%02d ", localTime.year(), 
                                        localTime.month() , localTime.day(),
                                        localTime.hour() , localTime.minute());
  
    
  t_httpCode responseCode = viessmannClient.GetFeatures(bufferStorePtr, bufferStoreLength, data_0_id, Gateways_0_Serial, Gateways_0_Devices_0_Id, apiSelectionPtr);

  
  
  Serial.printf("(%u) Viessmann Features: httpResponseCode is: %d\r\n", loadViFeaturesCount, responseCode);
  if (responseCode == t_http_codes::HTTP_CODE_OK)
  {
    //pApiSelectionPtr ->lastReadTimeSeconds = dateTimeUTCNow.secondstime();
    
    loadViFeaturesCount++;
    // After each successful request error counters are reset
    loadViFeaturesResp400Count = 0;
    loadViFeaturesRespOtherCount = 0;

    // Populate features array and set the name read from Api
    // with the name used in this Application
    features[0] = apiSelectionPtr ->_2_temperature_main;
    strcpy(features[0].name, (const char *)"_2_temperature_main");
    features[1] = apiSelectionPtr ->_4_boiler_temperature;
    strcpy(features[1].name, (const char *)"_4_boiler_temperature");
    features[2] = apiSelectionPtr ->_6_burner_modulation;
    strcpy(features[2].name, (const char *)"_6_burner_modulation");
    features[3] = apiSelectionPtr ->_7_burner_hours;
    strcpy(features[3].name, (const char *)"_7_burner_hours");
    features[4] = apiSelectionPtr ->_7_burner_starts;
    strcpy(features[4].name, (const char *)"_7_burner_starts");
    features[5] = apiSelectionPtr ->_8_burner_is_active;
    strcpy(features[5].name, (const char *)"_8_burner_is_active");
    features[6] = apiSelectionPtr ->_22_heating_curve_shift;
    strcpy(features[6].name, (const char *)"_22_heating_curve_shift");
    features[7] = apiSelectionPtr ->_22_heating_curve_slope;
    strcpy(features[7].name, (const char *)"_22_heating_curve_slope");
    features[8] = apiSelectionPtr ->_76_temperature_supply;
    strcpy(features[8].name, (const char *)"_76_temperature_supply");
    features[9] = apiSelectionPtr ->_84_heating_dhw_charging;
    strcpy(features[9].name, (const char *)"_84_heating_dhw_charging");
    features[10] = apiSelectionPtr ->_85_heating_dhw_pump_status;
    strcpy(features[10].name, (const char *)"_85_heating_dhw_pump_status");
    features[11] = apiSelectionPtr ->_87_heating_dhw_pump_primary_status;
    strcpy(features[11].name, (const char *)"_87_heating_dhw_pump_primary_status");
    features[12] = apiSelectionPtr ->_89_heating_dhw_cylinder_temperature;
    strcpy(features[12].name, (const char *)"_89_heating_dhw_cylinder_temperature");
    features[13] = apiSelectionPtr ->_91_heating_dhw_outlet_temperature;
    strcpy(features[13].name, (const char *)"_91_heating_dhw_outlet_temperature");
    features[14] = apiSelectionPtr ->_92_heating_dhw_main_temperature;
    strcpy(features[14].name, (const char *)"_92_heating_dhw_main_temperature");
    features[15] = apiSelectionPtr ->_94_heating_temperature_outside;
    strcpy(features[15].name, (const char *)"_94_heating_temperature_outside");

    //RoSchmi for debugging
    for (int i = 0; i < 16; i++)
    {
       if (strcmp((const char *) features[i].timestamp, "null") == 0)
       {
          while(true)
          {
            Serial.printf("Unknown timestamp was found\n");
            delay(5000);
          }
       } 
    }

    
    // Get 4 On/Off sensor values which were read from the Viessmann Api
    // and store them in a 'twin' of the sensor, reflecting its state 
    OnOffBurnerStatus.Feed(strcmp((const char *)(apiSelectionPtr ->_8_burner_is_active.value), (const char *)"true") == 0, dateTimeUTCNow);
    OnOffCirculationPumpStatus.Feed(strcmp((const char *)(apiSelectionPtr ->_10_circulation_pump_status.value), (const char *)"on") == 0, dateTimeUTCNow);
    OnOffHotWaterCircualtionPumpStatus.Feed(strcmp((const char *)(apiSelectionPtr ->_85_heating_dhw_pump_status.value), (const char *)"on") == 0, dateTimeUTCNow);
    OnOffHotWaterPrimaryPumpStatus.Feed(strcmp((apiSelectionPtr -> _87_heating_dhw_pump_primary_status.value), (const char *)"on") == 0, dateTimeUTCNow);   
  }
  else
  {
    
    if (responseCode == 400)
    {
      loadViFeaturesResp400Count++;
    }
    else
    {
      loadViFeaturesRespOtherCount++;
    }
    Serial.printf("Bad httpResponses, Code 400: %d, Others: %d\n", loadViFeaturesResp400Count, loadViFeaturesRespOtherCount);
  
    if (loadViFeaturesResp400Count > 20 || loadViFeaturesRespOtherCount > 20)
    {
      Serial.printf("Rebooting, failed Vi-Requests. 400: %d, others: %d\n", loadViFeaturesResp400Count, loadViFeaturesRespOtherCount);
      ESP.restart();
      while(true)
      {
        delay(500); //Wait for ever
      }
    }

