RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
#pragma region Commented old code snippets
/*
float ReadAnalogSensor_01(int pSensorIndex)
{
#ifndef USE_SIMULATED_SENSORVALUES
            // Use values read from an analog source
            // Change the function for each sensor to your needs
            // This is an an adaption for a gasmeter
              
              //RoSchmi: Next line was deleted
              //static float unclippedBaseValue_01 = 0.0;
              double theRead = MAGIC_NUMBER_INVALID;           
              if (analogSensorMgr.HasToBeRead(pSensorIndex, dateTimeUTCNow, true))
              {                              
                switch (pSensorIndex)
                {
                  case 0:
                    { 
                      char consumption[12] = {0};
                      AiOnTheEdgeApiSelection * aiOnTheEdgeApiSelectionPtr = gasmeterApiSelectionPtr;
                      
                      // select Feature by its name (pSensorName value, raw, pre, error, rate, timestamp)
                      AiOnTheEdgeApiSelection::Feature selectedFeature = ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, (const char *)"value", aiOnTheEdgeApiSelectionPtr);
                      strncpy(consumption, selectedFeature.value, sizeof(consumption));                        
                        
                      // Formatiere zu: Eine Nachkommastelle und nicht mehr als 4 Vorkommastellen
                      float tempNumber = (atof((const char *)consumption));
                      tempNumber = (tempNumber > 999.89 && tempNumber < 999.91) ? 999.9 : tempNumber * 10;
                      sprintf(consumption, "%.1f", tempNumber);
                      // Remove leading digits, so that the string is not longer than 6 characters
                      while (strlen(consumption) > 6)
                      {
                        memmove(consumption, consumption + 1, strlen(consumption));
                      }
                      

                      int32_t timeDiffUtcToLocal = localTime.secondstime() - dateTimeUTCNow.secondstime();                   
                      bool isNewDay = dateTimeUTCNow.operator+(timeDiffUtcToLocal).day() != dataContainer._lastSentTime.operator+(timeDiffUtcToLocal).day();
                      
                      //uint8_t dayUTC = dateTimeUTCNow.day();
                      //uint8_t daylocal = localTime.day();

                      Serial.printf("\n\nTimeDiffInSeconds: %d \n\n", timeDiffUtcToLocal);

                      if (dataContainer._isFirstTransmission || isNewDay)
                      {
                        dataContainer._baseValue = atof((const char *)consumption);                
                      }
                                                                
                      theRead = atof((const char *)consumption) / 100;
                     
                      // As an example we use it here to display an analog value read from the Viessmann Api   
                      
                      // Possible way to get a Viessmann Api Sensor value
                      //ViessmannApiSelection::Feature featureValue = ReadViessmannFeatureFromSelection((const char *)"_92_heating_dhw_outlet_temperature", VI_FEATURES_COUNT);
                      //theRead = atof((char *)featureValue.value);

                      // This is an alternative way to get a Viessmann Api Sensor valu                      
                      
                      //SampleValueSet featureValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, false);         
                      //theRead = featureValueSet.SampleValues[1].Value;
                      
                     
                      #if SERIAL_PRINT == 1
                        //Serial.printf("\r\nApi-Sensor: %.1f\r\n", theRead);
                      #endif

                      // Take theRead (nearly) 0.0 as invalid
                      // (if no sensor is connected the function returns 0)
                                             
                      //if (theRead > - 0.00001 && theRead < 0.00001)
                      //{
                      //  theRead = MAGIC_NUMBER_INVALID;
                      //}
                                                                                                                          
                    }
                    break;                   
                  case 1:
                    { 
                      char consumption[12] = {0};
                      AiOnTheEdgeApiSelection * aiOnTheEdgeApiSelectionPtr = gasmeterApiSelectionPtr;
                      
                      // select Feature by its name (pSensorName: value, raw, pre, error, rate or timestamp)
                      AiOnTheEdgeApiSelection::Feature selectedFeature = ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, (const char *)"value", aiOnTheEdgeApiSelectionPtr);
                      
                      strncpy(consumption, selectedFeature.value, sizeof(consumption));                        
                      
                      // Formatiere zu: Eine Nachkommastelle und nicht mehr als 3 Vorkommastellen
                      float tempNumber = (atof((const char *)consumption));
                      tempNumber = (tempNumber > 999.89 && tempNumber < 999.91) ? 999.9 : (tempNumber *10 );
                      sprintf(consumption, "%.1f", tempNumber);
                      // Remove leading digits, so that the string is not longer than 6 characters
                      while (strlen(consumption) > 6)
                      {
                        memmove(consumption, consumption + 1, strlen(consumption));
                      }

                      float actValue = atof((const char *)consumption);
                      float baseValue = dataContainer._baseValue;   // _baseValue was stored in case 0:
                          
                      // Get consumption from start of day or since programstart
                      theRead = actValue - baseValue;

