RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
                      printf("\nDay  -Consumption: %.1f\n", (float)theRead); 
                         
                    }
                    break;
                  case 2:
                    {
                      char consumption[12] = {0};
                      AiOnTheEdgeApiSelection * aiOnTheEdgeApiSelectionPtr = gasmeterApiSelectionPtr;
                      
                      // select Feature by its name (pSensorName value, raw, pre, error, rate, timestamp)
                      AiOnTheEdgeApiSelection::Feature selectedFeature = ReadAiOnTheEdgeApi_Analog_01(pSensorIndex, (const char *)"value", aiOnTheEdgeApiSelectionPtr);                      
                      strncpy(consumption, selectedFeature.value, sizeof(consumption));                        
                                         
                      // Formatiere zu: Eine Nachkommastelle und nicht mehr als 3 Vorkommastellen
                      float tempNumber = (atof((const char *)consumption));
                      tempNumber = (tempNumber > 999.89 && tempNumber < 999.91) ? 999.9 : (tempNumber *10 );
                      sprintf(consumption, "%.1f", tempNumber);
                      // Remove leading digits, so that the string is not longer than 6 characters
                      while (strlen(consumption) > 6)
                      {
                        memmove(consumption, consumption + 1, strlen(consumption));
                      }

                      float actValue = atof((const char *)consumption);
                      //float baseValue = dataContainer._baseValue;
                      float lastSentValue = dataContainer._SampleValuesSet.SampleValues[0].LastSendUnClippedValue;
                      uint32_t elapsedTime = dateTimeUTCNow.secondstime() - dataContainer._lastSentTime.secondstime();
                      if ((elapsedTime % 5) == 0)  // show only every fifth case
                      {                
                        Serial.printf("ReadAnalogSensor_01 Case 2: ActValue: %.1f LastSentValue: %.1f Elapsed: %d seconds\n", actValue, lastSentValue, elapsedTime);
                      }
                      
                      theRead = (actValue - lastSentValue) * 100 / ((dateTimeUTCNow.secondstime() - dataContainer._lastSentTime.secondstime())/ 60);


                      
                      
                    }
                    break;
                  case 3:
                    {
                      SampleValueSet featureValueSet = dataContainerAnalogViessmann01.getCheckedSampleValues(dateTimeUTCNow, false);         
                      theRead = featureValueSet.SampleValues[1].Value;
                      //theRead = atoi((char *)sSwiThresholdStr) / 10; // dummy
                      //Show ascending lines from 0 to 5, so re-boots of the board are indicated                                                
                        //theRead = ((double)(insertCounterAnalogTable % 50)) / 10;                      
                    }                   
                    break;
                }
              }                               
           return (float)theRead ;
#endif

#ifdef USE_SIMULATED_SENSORVALUES
      #ifdef USE_TEST_VALUES
            // Here you can select that diagnostic values (for debugging)
            // are sent to your storage table
            double theRead = MAGIC_NUMBER_INVALID;
            switch (pSensorIndex)
            {
                case 0:
                    {
                        theRead = timeNtpUpdateCounter;
                        theRead = theRead / 10; 
                    }
                    break;

                case 1:
                    {                       
                        theRead = sysTimeNtpDelta > 140 ? 140 : sysTimeNtpDelta < - 40 ? -40 : (double)sysTimeNtpDelta;                      
                    }
                    break;
                case 2:
                    {
                        theRead = insertCounterAnalogTable;
                        theRead = theRead / 10;                      
                    }
                    break;
                case 3:
                    {
                        theRead = lastResetCause;                       
                    }
                    break;
            }

            return theRead ;

  

        #endif
            
            onOffSwitcherWio.SetActive();
            // Only as an example we here return values which draw a sinus curve            
            int frequDeterminer = 4;
            int y_offset = 1;
            // different frequency and y_offset for aIn_0 to aIn_3
            if (pSensorIndex == 0)
            { frequDeterminer = 4; y_offset = 1; }
            if (pSensorIndex == 1)
            { frequDeterminer = 8; y_offset = 10; }
            if (pSensorIndex == 2)
            { frequDeterminer = 12; y_offset = 20; }
            if (pSensorIndex == 3)
            { frequDeterminer = 16; y_offset = 30; }
             
            int secondsOnDayElapsed = dateTimeUTCNow.second() + dateTimeUTCNow.minute() * 60 + dateTimeUTCNow.hour() *60 *60;

            // RoSchmi
            switch (pSensorIndex)
            {
              case 3:
              {

                //return (double)9.9;   // just something for now
                return lastResetCause;
              }
              break;
            
              case 2:
              { 
                uint32_t showInsertCounter = insertCounterAnalogTable % 50;               
                double theRead = ((double)showInsertCounter) / 10;
                return theRead;
              }
              break;
              case 0:
              case 1:
              {
                return roundf((float)25.0 * (float)sin(PI / 2.0 + (secondsOnDayElapsed * ((frequDeterminer * PI) / (float)86400)))) / 10  + y_offset;          
              }
              break;
              default:
              {
                return 0;
              }
            }
  #endif
}
*/
#pragma endregion

#pragma region Function createSampleTime(...)
//void createSampleTime(const DateTime pDateTimeUTCNow, const int timeZoneOffsetUTC, char * sampleTime, sampleTimeFormatOpt formatOpt = sampleTimeFormatOpt::FORMAT_FULL_1)
void createSampleTime(const DateTime pDateTimeUTCNow, const int timeZoneOffsetUTC, char * sampleTime, const SampleTimeFormatOpt formatOpt)
{
  DateTime localDateTimeUTC = pDateTimeUTCNow;
  int hoursOffset = timeZoneOffsetUTC / 60;
  int minutesOffset = timeZoneOffsetUTC % 60;
  char sign = timeZoneOffsetUTC < 0 ? '-' : '+';
  char TimeOffsetUTCString[10];
  sprintf(TimeOffsetUTCString, " %c%03i", sign, timeZoneOffsetUTC);
  TimeSpan timespanOffsetToUTC = TimeSpan(0, hoursOffset, minutesOffset, 0);
  //DateTime newDateTime = dateTimeUTCNow + timespanOffsetToUTC;
  DateTime newDateTime = localDateTimeUTC.operator+(timespanOffsetToUTC);
  switch (formatOpt)
  {
    case SampleTimeFormatOpt::FORMAT_DATE_GER:
    {
      sprintf(sampleTime, "%02i.%02i.%04i", newDateTime.day(), newDateTime.month(), newDateTime.year() );
    }   
    break;
    case SampleTimeFormatOpt::FORMAT_FULL_1:
    default:
    {
      sprintf(sampleTime, "%02i/%02i/%04i %02i:%02i:%02i%s",newDateTime.month(), newDateTime.day(), newDateTime.year(), newDateTime.hour(), newDateTime.minute(), newDateTime.second(), TimeOffsetUTCString);   
    }
    break;
  }
}
#pragma endregion

