RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
#pragma region Function makeRowKey(...) 
void makeRowKey(DateTime actDate,  az_span outSpan, size_t *outSpanLength)
{
  // formatting the RowKey (= reverseDate) this way to have the tables sorted with last added row upmost
  char rowKeyBuf[20] {0};

  sprintf(rowKeyBuf, "%4i%02i%02i%02i%02i%02i", (10000 - actDate.year()), (12 - actDate.month()), (31 - actDate.day()), (23 - actDate.hour()), (59 - actDate.minute()), (59 - actDate.second()));
  az_span retValue = az_span_create_from_str((char *)rowKeyBuf);
  az_span_copy(outSpan, retValue);
  *outSpanLength = retValue._internal.size;         
}
#pragma endregion

#pragma region Function makePartitionKey(...)
void makePartitionKey(const char * partitionKeyprefix, bool augmentWithYear, DateTime dateTime, az_span outSpan, size_t *outSpanLength)
{
  // if wanted, augment with year and month (12 - month for right order)                    
  char dateBuf[20] {0};
  sprintf(dateBuf, "%s%d-%02d", partitionKeyprefix, (dateTime.year()), (12 - dateTime.month()));                  
  az_span ret_1 = az_span_create_from_str((char *)dateBuf);
  az_span ret_2 = az_span_create_from_str((char *)partitionKeyprefix);                       
  if (augmentWithYear == true)
  {
    az_span_copy(outSpan, ret_1);            
    *outSpanLength = ret_1._internal.size; 
  }
    else
  {
    az_span_copy(outSpan, ret_2);
    *outSpanLength = ret_2._internal.size;
  }    
}
#pragma endregion

#pragma region Function isValidFloat(...)
bool isValidFloat(const char* str) 
{
  char* endptr;
  // Versuch, den String in float umzuwandeln
  float value = strtof(str, &endptr);

  // Wenn endptr zum Ende des Strings zeigt, war die Konvertierung erfolgreich
  if (*endptr == '\0' && endptr != str) {
      return true; // Ist eine gültige float-Zahl
  }
  return false; // Ungültig
}
#pragma endregion

#pragma region Function extractSubString(...)
bool extractSubString (const char * source, const String startTag, const String endTag, char * result, const int maxResultLength)
{
  char * start = strstr(source, startTag.c_str());
  if (start)
  {
    start += startTag.length();
    const char * end = strstr(start, endTag.c_str());
    if (end)
    {
      size_t length = end - start < maxResultLength - 1 ? end - start : maxResultLength - 1;
      strncpy(result, start, length);
      result[length] = '\0';      
      return true;
    }
    else
    {
      result[0] = '\0';
      return false;
    }
  }
  else
  {
     result[0] = '\0';
     return false;
  }
}
#pragma endregion

#pragma region Function setAiPreValueViaRestApi(...)
t_httpCode setAiPreValueViaRestApi(X509Certificate pCaCert, RestApiAccount * pRestApiAccount , const char * pPreValue)
{
  WiFiClient * selectedClient = pRestApiAccount -> UseHttps ? &secure_wifi_client : &plain_wifi_client;
  if (pRestApiAccount -> UseHttps && !(pRestApiAccount -> UseCaCert))
  {
    secure_wifi_client.setInsecure();
  }

  AiOnTheEdgeClient aiOnTheEdgeClient(pRestApiAccount, pCaCert, httpPtr, selectedClient);

  //t_httpCode responseCode = aiOnTheEdgeClient.SetPreValue((const char *)pUrl, pPreValue,  bufferStorePtr, bufferStoreLength);
  t_httpCode responseCode = aiOnTheEdgeClient.SetPreValue((const char *)(pRestApiAccount ->BaseUrl).c_str(), pPreValue,  bufferStorePtr, bufferStoreLength);

  if (responseCode == t_http_codes::HTTP_CODE_OK)
  {
      Serial.printf("\nPrevalue successfully set: %s\n", pPreValue);
  }

return responseCode;
}
#pragma endregion  

#pragma region Routine read_Vi_UserFromApi(...)
t_httpCode read_Vi_UserFromApi(X509Certificate pCaCert, ViessmannApiAccount * viessmannApiAccountPtr)
{
  WiFiClient * selectedClient = viessmannApiAccountPtr -> UseHttps ? &secure_wifi_client : &plain_wifi_client;
  
  if (viessmannApiAccountPtr -> UseHttps && !(viessmannApiAccountPtr -> UseCaCert))
  {
    secure_wifi_client.setInsecure();
  }
  

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, selectedClient, bufferStorePtr);
   #if SERIAL_PRINT == 1
        // Serial.println(myViessmannApiAccount.ClientId);
      #endif
      memset(viessmannApiUser,'\0', viessmannUserBufLen);
      memset(bufferStorePtr,'\0', bufferStoreLength);
      t_httpCode responseCode = viessmannClient.GetUser(bufferStorePtr, bufferStoreLength);
      Serial.printf("\r\nUser: httpResponseCode is: %d\r\n", responseCode);
      
      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {
        uint16_t cntToCopy = strlen((char*)bufferStorePtr) < viessmannUserBufLen ? strlen((char*)bufferStorePtr) : viessmannUserBufLen -1;
        memcpy(viessmannApiUser, bufferStorePtr, cntToCopy);       
      }    
return responseCode;
}
#pragma endregion

#pragma region Routine read_Vi_EquipmentFromApi(...)
t_httpCode read_Vi_EquipmentFromApi(X509Certificate pCaCert, ViessmannApiAccount * viessmannApiAccountPtr, uint32_t * p_data_0_id, const int equipBufLen, char * p_data_0_description, char * p_data_0_address_street, char * p_data_0_address_houseNumber, char * p_gateways_0_serial, char * p_gateways_0_devices_0_id)
{
  WiFiClient * selectedClient = viessmannApiAccountPtr -> UseHttps ? &secure_wifi_client : &plain_wifi_client;

  if (viessmannApiAccountPtr -> UseHttps && !(viessmannApiAccountPtr -> UseCaCert))
  {
    secure_wifi_client.setInsecure();
  }
  
  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, selectedClient, bufferStorePtr);
   #if SERIAL_PRINT == 1
        //Serial.println(myViessmannApiAccount.ClientId);
      #endif
      
      memset(bufferStorePtr, '\0', bufferStoreLength); 
      t_httpCode responseCode = viessmannClient.GetEquipment(bufferStorePtr, bufferStoreLength);
          
      Serial.printf("\r\nEquipment httpResponseCode is: %d\r\n", responseCode);

      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {
        const char* json = (char *)bufferStorePtr;
        JsonDocument doc;
        deserializeJson(doc, json);
        
        uint32_t data_0_id = doc["data"][0]["id"];
        const char * data_0_description = doc["data"][0]["description"];
        const char * data_0_address_street = doc["data"][0]["address"]["street"];
        const char * data_0_address_houseNumber = doc["data"][0]["address"]["houseNumber"];
        const char * gateways_0_serial = doc["data"][0]["gateways"][0]["serial"];
        const char * gateways_0_devices_0_id = doc["data"][0]["gateways"][0]["devices"][0]["id"];
        
