RoSchmi/Esp32_Viessm_Analog_Meter/src/main.cpp
        *p_data_0_id = data_0_id;
        memset(bufferStorePtr, '\0', bufferStoreLength);
         
        memset(p_data_0_description, '\0', equipBufLen);
        memset(p_data_0_address_street, '\0', equipBufLen);
        memset(p_data_0_address_houseNumber,'\0', equipBufLen);

        memset(p_gateways_0_serial,'\0', equipBufLen);
        memset(p_gateways_0_devices_0_id,'\0', equipBufLen);

        strncpy(p_data_0_description, data_0_description, equipBufLen - 1);
        strncpy(p_data_0_address_street, data_0_address_street, equipBufLen - 1);
        strncpy(p_data_0_address_houseNumber, data_0_address_houseNumber, equipBufLen - 1);

        strncpy(p_gateways_0_serial, gateways_0_serial, equipBufLen - 1);
        strncpy(p_gateways_0_devices_0_id, gateways_0_devices_0_id, equipBufLen - 1);       
      }
  return responseCode; 
}
#pragma endregion

#pragma region Routine refresh_Vi_AccessTokenFromApi(...)
t_httpCode refresh_Vi_AccessTokenFromApi(X509Certificate pCaCert, ViessmannApiAccount * viessmannApiAccountPtr, const char * refreshToken)
{
  WiFiClient * selectedClient = viessmannApiAccountPtr -> UseHttps ? &secure_wifi_client : &plain_wifi_client;
  
  if (viessmannApiAccountPtr -> UseHttps && !(viessmannApiAccountPtr -> UseCaCert))
  {
    secure_wifi_client.setInsecure();
  }
  
  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  const char * accessTokenLabel = "access_token";
  const char * refreshTokenLabel = "refresh_token";
  const char * tokenTypeLabel = "token_type";
  
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, selectedClient, bufferStorePtr); 
      memset(bufferStorePtr,'\0', bufferStoreLength);
      t_httpCode responseCode = viessmannClient.RefreshAccessToken(bufferStorePtr, bufferStoreLength, refreshToken);
      
      Serial.printf("\n(%u) %i/%02d/%02d %02d:%02d ", loadRefreshTokenCount, localTime.year(), 
                                        localTime.month() , localTime.day(),
                                        localTime.hour() , localTime.minute());
      Serial.println(F("Refreshing Access Token"));
      Serial.printf("(%u) Refresh Token: httpResponseCode: %d\r\n\r\n", loadRefreshTokenCount++, responseCode);
      
      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {    
         #if SERIAL_PRINT == 1
          // Serial.printf("%s\n", (char *)bufferStorePtr);
         #endif
         bool tokenIsValid = true;
         char * posAcTok = strnstr((char *)bufferStorePtr, (const char *)"access_token", 50);
         char * posRefrTok = strnstr((char *)bufferStorePtr, (const char *)"refresh_token", 2000);
         char * posTokType = strnstr((char *)bufferStorePtr, (const char *)"token_type", 2000);

         tokenIsValid = posAcTok == nullptr ? false : tokenIsValid;
         tokenIsValid = posRefrTok == nullptr ? false : tokenIsValid;
         tokenIsValid = posTokType == nullptr ? false : tokenIsValid;
         
         tokenIsValid = (tokenIsValid && (posAcTok < posRefrTok) && (posRefrTok < posTokType)) ? true : false;

         if (tokenIsValid)
         {
            char * startAcTok = posAcTok + strlen(accessTokenLabel) + 3;
            char * endAcTok = posRefrTok - 4;
            size_t acTokenLength = (size_t)endAcTok + 1 - (size_t)startAcTok;
            #if SERIAL_PRINT == 1
                Serial.printf("\nTokenlength is: %d\n", acTokenLength);
            #endif
            memcpy(viessmannAccessToken, startAcTok, acTokenLength);
            viessmannAccessToken[acTokenLength] = '\0';
            myViessmannApiAccountPtr ->RenewAccessToken(String(viessmannAccessToken));   
         }
         else
         {
            responseCode = HTTPC_ERROR_SEND_PAYLOAD_FAILED;
            Serial.println(F("Content error. Refreshing Accesstoken failed!\n"));
            bufferStorePtr[bufferStoreLength - 1] = '\0';
            Serial.println((char *)bufferStorePtr);
         }
      }
      else
      {  
        Serial.println(F("Response Error. Refreshing Accesstoken failed!\n"));   
        bufferStorePtr[bufferStoreLength - 1] = '\0';
        Serial.println((char *)bufferStorePtr);
      }
   return responseCode;
      
}
#pragma endregion

#pragma region Routine createTable(...)   //Azure Storage Table
az_http_status_code createTable(CloudStorageAccount *pAccountPtr, X509Certificate pCaCert, const char * pTableName)
{ 

  #if AZURE_TRANSPORT_PROTOKOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif

    #if AZURE_TRANSPORT_PROTOKOL == 1
    wifi_client.setCACert(myX509Certificate);
    //wifi_client.setCACert(baltimore_corrupt_root_ca);
  #endif

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif
  
  TableClient table(pAccountPtr, pCaCert,  httpPtr, &wifi_client, bufferStorePtr);
  
  // Create Table
  az_http_status_code statusCode = table.CreateTable(pTableName, dateTimeUTCNow, ContType::contApplicationIatomIxml, AcceptType::acceptApplicationIjson, returnContent, false);
  
   // RoSchmi for tests: to simulate failed upload
   //az_http_status_code   statusCode = AZ_HTTP_STATUS_CODE_UNAUTHORIZED;

  char codeString[35] {0};
  if ((statusCode == AZ_HTTP_STATUS_CODE_CONFLICT) || (statusCode == AZ_HTTP_STATUS_CODE_CREATED))
  {
    #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
    #endif
   
      sprintf(codeString, "%s %i", "Table available: ", az_http_status_code(statusCode));
      #if SERIAL_PRINT == 1
        Serial.println((char *)codeString);
      #endif
  
  }
  else
  {
      sprintf(codeString, "%s %i", "Table Creation failed: ", az_http_status_code(statusCode));
      //#if SERIAL_PRINT == 1   
        Serial.println((char *)codeString);
      //#endif
 
    delay(1000);
    //RoSchmi (temporary commented)
    ESP.restart();    
  }
return statusCode;
}
#pragma endregion

#pragma region Routine insertTableEntity(...)    //Azure Storage Table
az_http_status_code insertTableEntity(CloudStorageAccount *pAccountPtr,  X509Certificate pCaCert, const char * pTableName, TableEntity pTableEntity, char * outInsertETag)
{ 
  #if AZURE_TRANSPORT_PROTOKOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif
  
